leonNg369/tc234_pxros_bsp_example/bsp/uc/uc_tc23/reg_tc23x_um_v1.1.R1/_Reg/IfxEray_bf.h
/** \brief  Length for Ifx_ERAY_CUST1_Bits.IBF1PAG */
#define IFX_ERAY_CUST1_IBF1PAG_LEN (1u)

/** \brief  Mask for Ifx_ERAY_CUST1_Bits.IBF1PAG */
#define IFX_ERAY_CUST1_IBF1PAG_MSK (0x1u)

/** \brief  Offset for Ifx_ERAY_CUST1_Bits.IBF1PAG */
#define IFX_ERAY_CUST1_IBF1PAG_OFF (4u)

/** \brief  Length for Ifx_ERAY_CUST1_Bits.IBF2PAG */
#define IFX_ERAY_CUST1_IBF2PAG_LEN (1u)

/** \brief  Mask for Ifx_ERAY_CUST1_Bits.IBF2PAG */
#define IFX_ERAY_CUST1_IBF2PAG_MSK (0x1u)

/** \brief  Offset for Ifx_ERAY_CUST1_Bits.IBF2PAG */
#define IFX_ERAY_CUST1_IBF2PAG_OFF (7u)

/** \brief  Length for Ifx_ERAY_CUST1_Bits.IBFS */
#define IFX_ERAY_CUST1_IBFS_LEN (1u)

/** \brief  Mask for Ifx_ERAY_CUST1_Bits.IBFS */
#define IFX_ERAY_CUST1_IBFS_MSK (0x1u)

/** \brief  Offset for Ifx_ERAY_CUST1_Bits.IBFS */
#define IFX_ERAY_CUST1_IBFS_OFF (3u)

/** \brief  Length for Ifx_ERAY_CUST1_Bits.IEN */
#define IFX_ERAY_CUST1_IEN_LEN (1u)

/** \brief  Mask for Ifx_ERAY_CUST1_Bits.IEN */
#define IFX_ERAY_CUST1_IEN_MSK (0x1u)

/** \brief  Offset for Ifx_ERAY_CUST1_Bits.IEN */
#define IFX_ERAY_CUST1_IEN_OFF (2u)

/** \brief  Length for Ifx_ERAY_CUST1_Bits.INT0 */
#define IFX_ERAY_CUST1_INT0_LEN (1u)

/** \brief  Mask for Ifx_ERAY_CUST1_Bits.INT0 */
#define IFX_ERAY_CUST1_INT0_MSK (0x1u)

/** \brief  Offset for Ifx_ERAY_CUST1_Bits.INT0 */
#define IFX_ERAY_CUST1_INT0_OFF (0u)

/** \brief  Length for Ifx_ERAY_CUST1_Bits.OEN */
#define IFX_ERAY_CUST1_OEN_LEN (1u)

/** \brief  Mask for Ifx_ERAY_CUST1_Bits.OEN */
#define IFX_ERAY_CUST1_OEN_MSK (0x1u)

/** \brief  Offset for Ifx_ERAY_CUST1_Bits.OEN */
#define IFX_ERAY_CUST1_OEN_OFF (1u)

/** \brief  Length for Ifx_ERAY_CUST1_Bits.RISA */
#define IFX_ERAY_CUST1_RISA_LEN (2u)

/** \brief  Mask for Ifx_ERAY_CUST1_Bits.RISA */
#define IFX_ERAY_CUST1_RISA_MSK (0x3u)

/** \brief  Offset for Ifx_ERAY_CUST1_Bits.RISA */
#define IFX_ERAY_CUST1_RISA_OFF (10u)

/** \brief  Length for Ifx_ERAY_CUST1_Bits.RISB */
#define IFX_ERAY_CUST1_RISB_LEN (2u)

/** \brief  Mask for Ifx_ERAY_CUST1_Bits.RISB */
#define IFX_ERAY_CUST1_RISB_MSK (0x3u)

/** \brief  Offset for Ifx_ERAY_CUST1_Bits.RISB */
#define IFX_ERAY_CUST1_RISB_OFF (12u)

/** \brief  Length for Ifx_ERAY_CUST1_Bits.STPWTS */
#define IFX_ERAY_CUST1_STPWTS_LEN (2u)

/** \brief  Mask for Ifx_ERAY_CUST1_Bits.STPWTS */
#define IFX_ERAY_CUST1_STPWTS_MSK (0x3u)

/** \brief  Offset for Ifx_ERAY_CUST1_Bits.STPWTS */
#define IFX_ERAY_CUST1_STPWTS_OFF (14u)

/** \brief  Length for Ifx_ERAY_CUST3_Bits.TO */
#define IFX_ERAY_CUST3_TO_LEN (32u)

/** \brief  Mask for Ifx_ERAY_CUST3_Bits.TO */
#define IFX_ERAY_CUST3_TO_MSK (0xffffffffu)

/** \brief  Offset for Ifx_ERAY_CUST3_Bits.TO */
#define IFX_ERAY_CUST3_TO_OFF (0u)

/** \brief  Length for Ifx_ERAY_EIER_Bits.CCFE */
#define IFX_ERAY_EIER_CCFE_LEN (1u)

/** \brief  Mask for Ifx_ERAY_EIER_Bits.CCFE */
#define IFX_ERAY_EIER_CCFE_MSK (0x1u)

/** \brief  Offset for Ifx_ERAY_EIER_Bits.CCFE */
#define IFX_ERAY_EIER_CCFE_OFF (4u)

/** \brief  Length for Ifx_ERAY_EIER_Bits.CCLE */
#define IFX_ERAY_EIER_CCLE_LEN (1u)

/** \brief  Mask for Ifx_ERAY_EIER_Bits.CCLE */
#define IFX_ERAY_EIER_CCLE_MSK (0x1u)

/** \brief  Offset for Ifx_ERAY_EIER_Bits.CCLE */
#define IFX_ERAY_EIER_CCLE_OFF (5u)

/** \brief  Length for Ifx_ERAY_EIER_Bits.CNAE */
#define IFX_ERAY_EIER_CNAE_LEN (1u)

/** \brief  Mask for Ifx_ERAY_EIER_Bits.CNAE */
#define IFX_ERAY_EIER_CNAE_MSK (0x1u)

/** \brief  Offset for Ifx_ERAY_EIER_Bits.CNAE */
#define IFX_ERAY_EIER_CNAE_OFF (1u)

/** \brief  Length for Ifx_ERAY_EIER_Bits.EDAE */
#define IFX_ERAY_EIER_EDAE_LEN (1u)

/** \brief  Mask for Ifx_ERAY_EIER_Bits.EDAE */
#define IFX_ERAY_EIER_EDAE_MSK (0x1u)

/** \brief  Offset for Ifx_ERAY_EIER_Bits.EDAE */
#define IFX_ERAY_EIER_EDAE_OFF (16u)

/** \brief  Length for Ifx_ERAY_EIER_Bits.EDBE */
#define IFX_ERAY_EIER_EDBE_LEN (1u)

/** \brief  Mask for Ifx_ERAY_EIER_Bits.EDBE */
#define IFX_ERAY_EIER_EDBE_MSK (0x1u)

/** \brief  Offset for Ifx_ERAY_EIER_Bits.EDBE */
#define IFX_ERAY_EIER_EDBE_OFF (24u)

/** \brief  Length for Ifx_ERAY_EIER_Bits.EERRE */
#define IFX_ERAY_EIER_EERRE_LEN (1u)

/** \brief  Mask for Ifx_ERAY_EIER_Bits.EERRE */
#define IFX_ERAY_EIER_EERRE_MSK (0x1u)

/** \brief  Offset for Ifx_ERAY_EIER_Bits.EERRE */
#define IFX_ERAY_EIER_EERRE_OFF (6u)

/** \brief  Length for Ifx_ERAY_EIER_Bits.EFAE */
#define IFX_ERAY_EIER_EFAE_LEN (1u)

/** \brief  Mask for Ifx_ERAY_EIER_Bits.EFAE */
#define IFX_ERAY_EIER_EFAE_MSK (0x1u)

/** \brief  Offset for Ifx_ERAY_EIER_Bits.EFAE */
#define IFX_ERAY_EIER_EFAE_OFF (8u)

/** \brief  Length for Ifx_ERAY_EIER_Bits.IIBAE */
#define IFX_ERAY_EIER_IIBAE_LEN (1u)

/** \brief  Mask for Ifx_ERAY_EIER_Bits.IIBAE */
#define IFX_ERAY_EIER_IIBAE_MSK (0x1u)

/** \brief  Offset for Ifx_ERAY_EIER_Bits.IIBAE */
#define IFX_ERAY_EIER_IIBAE_OFF (9u)

/** \brief  Length for Ifx_ERAY_EIER_Bits.IOBAE */
#define IFX_ERAY_EIER_IOBAE_LEN (1u)

/** \brief  Mask for Ifx_ERAY_EIER_Bits.IOBAE */
#define IFX_ERAY_EIER_IOBAE_MSK (0x1u)

/** \brief  Offset for Ifx_ERAY_EIER_Bits.IOBAE */
#define IFX_ERAY_EIER_IOBAE_OFF (10u)

/** \brief  Length for Ifx_ERAY_EIER_Bits.LTVAE */
#define IFX_ERAY_EIER_LTVAE_LEN (1u)

/** \brief  Mask for Ifx_ERAY_EIER_Bits.LTVAE */
#define IFX_ERAY_EIER_LTVAE_MSK (0x1u)

/** \brief  Offset for Ifx_ERAY_EIER_Bits.LTVAE */
#define IFX_ERAY_EIER_LTVAE_OFF (17u)

/** \brief  Length for Ifx_ERAY_EIER_Bits.LTVBE */
#define IFX_ERAY_EIER_LTVBE_LEN (1u)

/** \brief  Mask for Ifx_ERAY_EIER_Bits.LTVBE */
#define IFX_ERAY_EIER_LTVBE_MSK (0x1u)

/** \brief  Offset for Ifx_ERAY_EIER_Bits.LTVBE */
#define IFX_ERAY_EIER_LTVBE_OFF (25u)

/** \brief  Length for Ifx_ERAY_EIER_Bits.MHFE */
#define IFX_ERAY_EIER_MHFE_LEN (1u)

/** \brief  Mask for Ifx_ERAY_EIER_Bits.MHFE */
#define IFX_ERAY_EIER_MHFE_MSK (0x1u)

/** \brief  Offset for Ifx_ERAY_EIER_Bits.MHFE */
#define IFX_ERAY_EIER_MHFE_OFF (11u)

/** \brief  Length for Ifx_ERAY_EIER_Bits.PEMCE */
#define IFX_ERAY_EIER_PEMCE_LEN (1u)

/** \brief  Mask for Ifx_ERAY_EIER_Bits.PEMCE */
#define IFX_ERAY_EIER_PEMCE_MSK (0x1u)

