leonNg369/tc234_pxros_bsp_example/bsp/uc/uc_tc23/reg_tc23x_um_v1.1.R1/_Reg/IfxEray_bf.h
/** \brief  Offset for Ifx_ERAY_EIER_Bits.PEMCE */
#define IFX_ERAY_EIER_PEMCE_OFF (0u)

/** \brief  Length for Ifx_ERAY_EIER_Bits.RFOE */
#define IFX_ERAY_EIER_RFOE_LEN (1u)

/** \brief  Mask for Ifx_ERAY_EIER_Bits.RFOE */
#define IFX_ERAY_EIER_RFOE_MSK (0x1u)

/** \brief  Offset for Ifx_ERAY_EIER_Bits.RFOE */
#define IFX_ERAY_EIER_RFOE_OFF (7u)

/** \brief  Length for Ifx_ERAY_EIER_Bits.SFBME */
#define IFX_ERAY_EIER_SFBME_LEN (1u)

/** \brief  Mask for Ifx_ERAY_EIER_Bits.SFBME */
#define IFX_ERAY_EIER_SFBME_MSK (0x1u)

/** \brief  Offset for Ifx_ERAY_EIER_Bits.SFBME */
#define IFX_ERAY_EIER_SFBME_OFF (2u)

/** \brief  Length for Ifx_ERAY_EIER_Bits.SFOE */
#define IFX_ERAY_EIER_SFOE_LEN (1u)

/** \brief  Mask for Ifx_ERAY_EIER_Bits.SFOE */
#define IFX_ERAY_EIER_SFOE_MSK (0x1u)

/** \brief  Offset for Ifx_ERAY_EIER_Bits.SFOE */
#define IFX_ERAY_EIER_SFOE_OFF (3u)

/** \brief  Length for Ifx_ERAY_EIER_Bits.TABAE */
#define IFX_ERAY_EIER_TABAE_LEN (1u)

/** \brief  Mask for Ifx_ERAY_EIER_Bits.TABAE */
#define IFX_ERAY_EIER_TABAE_MSK (0x1u)

/** \brief  Offset for Ifx_ERAY_EIER_Bits.TABAE */
#define IFX_ERAY_EIER_TABAE_OFF (18u)

/** \brief  Length for Ifx_ERAY_EIER_Bits.TABBE */
#define IFX_ERAY_EIER_TABBE_LEN (1u)

/** \brief  Mask for Ifx_ERAY_EIER_Bits.TABBE */
#define IFX_ERAY_EIER_TABBE_MSK (0x1u)

/** \brief  Offset for Ifx_ERAY_EIER_Bits.TABBE */
#define IFX_ERAY_EIER_TABBE_OFF (26u)

/** \brief  Length for Ifx_ERAY_EIES_Bits.CCFE */
#define IFX_ERAY_EIES_CCFE_LEN (1u)

/** \brief  Mask for Ifx_ERAY_EIES_Bits.CCFE */
#define IFX_ERAY_EIES_CCFE_MSK (0x1u)

/** \brief  Offset for Ifx_ERAY_EIES_Bits.CCFE */
#define IFX_ERAY_EIES_CCFE_OFF (4u)

/** \brief  Length for Ifx_ERAY_EIES_Bits.CCLE */
#define IFX_ERAY_EIES_CCLE_LEN (1u)

/** \brief  Mask for Ifx_ERAY_EIES_Bits.CCLE */
#define IFX_ERAY_EIES_CCLE_MSK (0x1u)

/** \brief  Offset for Ifx_ERAY_EIES_Bits.CCLE */
#define IFX_ERAY_EIES_CCLE_OFF (5u)

/** \brief  Length for Ifx_ERAY_EIES_Bits.CNAE */
#define IFX_ERAY_EIES_CNAE_LEN (1u)

/** \brief  Mask for Ifx_ERAY_EIES_Bits.CNAE */
#define IFX_ERAY_EIES_CNAE_MSK (0x1u)

/** \brief  Offset for Ifx_ERAY_EIES_Bits.CNAE */
#define IFX_ERAY_EIES_CNAE_OFF (1u)

/** \brief  Length for Ifx_ERAY_EIES_Bits.EDAE */
#define IFX_ERAY_EIES_EDAE_LEN (1u)

/** \brief  Mask for Ifx_ERAY_EIES_Bits.EDAE */
#define IFX_ERAY_EIES_EDAE_MSK (0x1u)

/** \brief  Offset for Ifx_ERAY_EIES_Bits.EDAE */
#define IFX_ERAY_EIES_EDAE_OFF (16u)

/** \brief  Length for Ifx_ERAY_EIES_Bits.EDBE */
#define IFX_ERAY_EIES_EDBE_LEN (1u)

/** \brief  Mask for Ifx_ERAY_EIES_Bits.EDBE */
#define IFX_ERAY_EIES_EDBE_MSK (0x1u)

/** \brief  Offset for Ifx_ERAY_EIES_Bits.EDBE */
#define IFX_ERAY_EIES_EDBE_OFF (24u)

/** \brief  Length for Ifx_ERAY_EIES_Bits.EERRE */
#define IFX_ERAY_EIES_EERRE_LEN (1u)

/** \brief  Mask for Ifx_ERAY_EIES_Bits.EERRE */
#define IFX_ERAY_EIES_EERRE_MSK (0x1u)

/** \brief  Offset for Ifx_ERAY_EIES_Bits.EERRE */
#define IFX_ERAY_EIES_EERRE_OFF (6u)

/** \brief  Length for Ifx_ERAY_EIES_Bits.EFAE */
#define IFX_ERAY_EIES_EFAE_LEN (1u)

/** \brief  Mask for Ifx_ERAY_EIES_Bits.EFAE */
#define IFX_ERAY_EIES_EFAE_MSK (0x1u)

/** \brief  Offset for Ifx_ERAY_EIES_Bits.EFAE */
#define IFX_ERAY_EIES_EFAE_OFF (8u)

/** \brief  Length for Ifx_ERAY_EIES_Bits.IIBAE */
#define IFX_ERAY_EIES_IIBAE_LEN (1u)

/** \brief  Mask for Ifx_ERAY_EIES_Bits.IIBAE */
#define IFX_ERAY_EIES_IIBAE_MSK (0x1u)

/** \brief  Offset for Ifx_ERAY_EIES_Bits.IIBAE */
#define IFX_ERAY_EIES_IIBAE_OFF (9u)

/** \brief  Length for Ifx_ERAY_EIES_Bits.IOBAE */
#define IFX_ERAY_EIES_IOBAE_LEN (1u)

/** \brief  Mask for Ifx_ERAY_EIES_Bits.IOBAE */
#define IFX_ERAY_EIES_IOBAE_MSK (0x1u)

/** \brief  Offset for Ifx_ERAY_EIES_Bits.IOBAE */
#define IFX_ERAY_EIES_IOBAE_OFF (10u)

/** \brief  Length for Ifx_ERAY_EIES_Bits.LTVAE */
#define IFX_ERAY_EIES_LTVAE_LEN (1u)

/** \brief  Mask for Ifx_ERAY_EIES_Bits.LTVAE */
#define IFX_ERAY_EIES_LTVAE_MSK (0x1u)

/** \brief  Offset for Ifx_ERAY_EIES_Bits.LTVAE */
#define IFX_ERAY_EIES_LTVAE_OFF (17u)

/** \brief  Length for Ifx_ERAY_EIES_Bits.LTVBE */
#define IFX_ERAY_EIES_LTVBE_LEN (1u)

/** \brief  Mask for Ifx_ERAY_EIES_Bits.LTVBE */
#define IFX_ERAY_EIES_LTVBE_MSK (0x1u)

/** \brief  Offset for Ifx_ERAY_EIES_Bits.LTVBE */
#define IFX_ERAY_EIES_LTVBE_OFF (25u)

/** \brief  Length for Ifx_ERAY_EIES_Bits.MHFE */
#define IFX_ERAY_EIES_MHFE_LEN (1u)

/** \brief  Mask for Ifx_ERAY_EIES_Bits.MHFE */
#define IFX_ERAY_EIES_MHFE_MSK (0x1u)

/** \brief  Offset for Ifx_ERAY_EIES_Bits.MHFE */
#define IFX_ERAY_EIES_MHFE_OFF (11u)

/** \brief  Length for Ifx_ERAY_EIES_Bits.PEMCE */
#define IFX_ERAY_EIES_PEMCE_LEN (1u)

/** \brief  Mask for Ifx_ERAY_EIES_Bits.PEMCE */
#define IFX_ERAY_EIES_PEMCE_MSK (0x1u)

/** \brief  Offset for Ifx_ERAY_EIES_Bits.PEMCE */
#define IFX_ERAY_EIES_PEMCE_OFF (0u)

/** \brief  Length for Ifx_ERAY_EIES_Bits.RFOE */
#define IFX_ERAY_EIES_RFOE_LEN (1u)

/** \brief  Mask for Ifx_ERAY_EIES_Bits.RFOE */
#define IFX_ERAY_EIES_RFOE_MSK (0x1u)

/** \brief  Offset for Ifx_ERAY_EIES_Bits.RFOE */
#define IFX_ERAY_EIES_RFOE_OFF (7u)

/** \brief  Length for Ifx_ERAY_EIES_Bits.SFBME */
#define IFX_ERAY_EIES_SFBME_LEN (1u)

/** \brief  Mask for Ifx_ERAY_EIES_Bits.SFBME */
#define IFX_ERAY_EIES_SFBME_MSK (0x1u)

/** \brief  Offset for Ifx_ERAY_EIES_Bits.SFBME */
#define IFX_ERAY_EIES_SFBME_OFF (2u)

/** \brief  Length for Ifx_ERAY_EIES_Bits.SFOE */
#define IFX_ERAY_EIES_SFOE_LEN (1u)

/** \brief  Mask for Ifx_ERAY_EIES_Bits.SFOE */
#define IFX_ERAY_EIES_SFOE_MSK (0x1u)

/** \brief  Offset for Ifx_ERAY_EIES_Bits.SFOE */
#define IFX_ERAY_EIES_SFOE_OFF (3u)

/** \brief  Length for Ifx_ERAY_EIES_Bits.TABAE */
#define IFX_ERAY_EIES_TABAE_LEN (1u)

/** \brief  Mask for Ifx_ERAY_EIES_Bits.TABAE */
#define IFX_ERAY_EIES_TABAE_MSK (0x1u)

/** \brief  Offset for Ifx_ERAY_EIES_Bits.TABAE */
#define IFX_ERAY_EIES_TABAE_OFF (18u)

/** \brief  Length for Ifx_ERAY_EIES_Bits.TABBE */
#define IFX_ERAY_EIES_TABBE_LEN (1u)

/** \brief  Mask for Ifx_ERAY_EIES_Bits.TABBE */
#define IFX_ERAY_EIES_TABBE_MSK (0x1u)

