leonNg369/tc234_pxros_bsp_example/bsp/uc/uc_tc23/reg_tc23x_um_v1.1.R1/_Reg/IfxEray_bf.h
/** \brief  Mask for Ifx_ERAY_MBSC3_Bits.MBC90 */
#define IFX_ERAY_MBSC3_MBC90_MSK (0x1u)

/** \brief  Offset for Ifx_ERAY_MBSC3_Bits.MBC90 */
#define IFX_ERAY_MBSC3_MBC90_OFF (26u)

/** \brief  Length for Ifx_ERAY_MBSC3_Bits.MBC91 */
#define IFX_ERAY_MBSC3_MBC91_LEN (1u)

/** \brief  Mask for Ifx_ERAY_MBSC3_Bits.MBC91 */
#define IFX_ERAY_MBSC3_MBC91_MSK (0x1u)

/** \brief  Offset for Ifx_ERAY_MBSC3_Bits.MBC91 */
#define IFX_ERAY_MBSC3_MBC91_OFF (27u)

/** \brief  Length for Ifx_ERAY_MBSC3_Bits.MBC92 */
#define IFX_ERAY_MBSC3_MBC92_LEN (1u)

/** \brief  Mask for Ifx_ERAY_MBSC3_Bits.MBC92 */
#define IFX_ERAY_MBSC3_MBC92_MSK (0x1u)

/** \brief  Offset for Ifx_ERAY_MBSC3_Bits.MBC92 */
#define IFX_ERAY_MBSC3_MBC92_OFF (28u)

/** \brief  Length for Ifx_ERAY_MBSC3_Bits.MBC93 */
#define IFX_ERAY_MBSC3_MBC93_LEN (1u)

/** \brief  Mask for Ifx_ERAY_MBSC3_Bits.MBC93 */
#define IFX_ERAY_MBSC3_MBC93_MSK (0x1u)

/** \brief  Offset for Ifx_ERAY_MBSC3_Bits.MBC93 */
#define IFX_ERAY_MBSC3_MBC93_OFF (29u)

/** \brief  Length for Ifx_ERAY_MBSC3_Bits.MBC94 */
#define IFX_ERAY_MBSC3_MBC94_LEN (1u)

/** \brief  Mask for Ifx_ERAY_MBSC3_Bits.MBC94 */
#define IFX_ERAY_MBSC3_MBC94_MSK (0x1u)

/** \brief  Offset for Ifx_ERAY_MBSC3_Bits.MBC94 */
#define IFX_ERAY_MBSC3_MBC94_OFF (30u)

/** \brief  Length for Ifx_ERAY_MBSC3_Bits.MBC95 */
#define IFX_ERAY_MBSC3_MBC95_LEN (1u)

/** \brief  Mask for Ifx_ERAY_MBSC3_Bits.MBC95 */
#define IFX_ERAY_MBSC3_MBC95_MSK (0x1u)

/** \brief  Offset for Ifx_ERAY_MBSC3_Bits.MBC95 */
#define IFX_ERAY_MBSC3_MBC95_OFF (31u)

/** \brief  Length for Ifx_ERAY_MBSC4_Bits.MBC100 */
#define IFX_ERAY_MBSC4_MBC100_LEN (1u)

/** \brief  Mask for Ifx_ERAY_MBSC4_Bits.MBC100 */
#define IFX_ERAY_MBSC4_MBC100_MSK (0x1u)

/** \brief  Offset for Ifx_ERAY_MBSC4_Bits.MBC100 */
#define IFX_ERAY_MBSC4_MBC100_OFF (4u)

/** \brief  Length for Ifx_ERAY_MBSC4_Bits.MBC101 */
#define IFX_ERAY_MBSC4_MBC101_LEN (1u)

/** \brief  Mask for Ifx_ERAY_MBSC4_Bits.MBC101 */
#define IFX_ERAY_MBSC4_MBC101_MSK (0x1u)

/** \brief  Offset for Ifx_ERAY_MBSC4_Bits.MBC101 */
#define IFX_ERAY_MBSC4_MBC101_OFF (5u)

/** \brief  Length for Ifx_ERAY_MBSC4_Bits.MBC102 */
#define IFX_ERAY_MBSC4_MBC102_LEN (1u)

/** \brief  Mask for Ifx_ERAY_MBSC4_Bits.MBC102 */
#define IFX_ERAY_MBSC4_MBC102_MSK (0x1u)

/** \brief  Offset for Ifx_ERAY_MBSC4_Bits.MBC102 */
#define IFX_ERAY_MBSC4_MBC102_OFF (6u)

/** \brief  Length for Ifx_ERAY_MBSC4_Bits.MBC103 */
#define IFX_ERAY_MBSC4_MBC103_LEN (1u)

/** \brief  Mask for Ifx_ERAY_MBSC4_Bits.MBC103 */
#define IFX_ERAY_MBSC4_MBC103_MSK (0x1u)

/** \brief  Offset for Ifx_ERAY_MBSC4_Bits.MBC103 */
#define IFX_ERAY_MBSC4_MBC103_OFF (7u)

/** \brief  Length for Ifx_ERAY_MBSC4_Bits.MBC104 */
#define IFX_ERAY_MBSC4_MBC104_LEN (1u)

/** \brief  Mask for Ifx_ERAY_MBSC4_Bits.MBC104 */
#define IFX_ERAY_MBSC4_MBC104_MSK (0x1u)

/** \brief  Offset for Ifx_ERAY_MBSC4_Bits.MBC104 */
#define IFX_ERAY_MBSC4_MBC104_OFF (8u)

/** \brief  Length for Ifx_ERAY_MBSC4_Bits.MBC105 */
#define IFX_ERAY_MBSC4_MBC105_LEN (1u)

/** \brief  Mask for Ifx_ERAY_MBSC4_Bits.MBC105 */
#define IFX_ERAY_MBSC4_MBC105_MSK (0x1u)

/** \brief  Offset for Ifx_ERAY_MBSC4_Bits.MBC105 */
#define IFX_ERAY_MBSC4_MBC105_OFF (9u)

/** \brief  Length for Ifx_ERAY_MBSC4_Bits.MBC106 */
#define IFX_ERAY_MBSC4_MBC106_LEN (1u)

/** \brief  Mask for Ifx_ERAY_MBSC4_Bits.MBC106 */
#define IFX_ERAY_MBSC4_MBC106_MSK (0x1u)

/** \brief  Offset for Ifx_ERAY_MBSC4_Bits.MBC106 */
#define IFX_ERAY_MBSC4_MBC106_OFF (10u)

/** \brief  Length for Ifx_ERAY_MBSC4_Bits.MBC107 */
#define IFX_ERAY_MBSC4_MBC107_LEN (1u)

/** \brief  Mask for Ifx_ERAY_MBSC4_Bits.MBC107 */
#define IFX_ERAY_MBSC4_MBC107_MSK (0x1u)

/** \brief  Offset for Ifx_ERAY_MBSC4_Bits.MBC107 */
#define IFX_ERAY_MBSC4_MBC107_OFF (11u)

/** \brief  Length for Ifx_ERAY_MBSC4_Bits.MBC108 */
#define IFX_ERAY_MBSC4_MBC108_LEN (1u)

/** \brief  Mask for Ifx_ERAY_MBSC4_Bits.MBC108 */
#define IFX_ERAY_MBSC4_MBC108_MSK (0x1u)

/** \brief  Offset for Ifx_ERAY_MBSC4_Bits.MBC108 */
#define IFX_ERAY_MBSC4_MBC108_OFF (12u)

/** \brief  Length for Ifx_ERAY_MBSC4_Bits.MBC109 */
#define IFX_ERAY_MBSC4_MBC109_LEN (1u)

/** \brief  Mask for Ifx_ERAY_MBSC4_Bits.MBC109 */
#define IFX_ERAY_MBSC4_MBC109_MSK (0x1u)

/** \brief  Offset for Ifx_ERAY_MBSC4_Bits.MBC109 */
#define IFX_ERAY_MBSC4_MBC109_OFF (13u)

/** \brief  Length for Ifx_ERAY_MBSC4_Bits.MBC110 */
#define IFX_ERAY_MBSC4_MBC110_LEN (1u)

/** \brief  Mask for Ifx_ERAY_MBSC4_Bits.MBC110 */
#define IFX_ERAY_MBSC4_MBC110_MSK (0x1u)

/** \brief  Offset for Ifx_ERAY_MBSC4_Bits.MBC110 */
#define IFX_ERAY_MBSC4_MBC110_OFF (14u)

/** \brief  Length for Ifx_ERAY_MBSC4_Bits.MBC111 */
#define IFX_ERAY_MBSC4_MBC111_LEN (1u)

/** \brief  Mask for Ifx_ERAY_MBSC4_Bits.MBC111 */
#define IFX_ERAY_MBSC4_MBC111_MSK (0x1u)

/** \brief  Offset for Ifx_ERAY_MBSC4_Bits.MBC111 */
#define IFX_ERAY_MBSC4_MBC111_OFF (15u)

/** \brief  Length for Ifx_ERAY_MBSC4_Bits.MBC112 */
#define IFX_ERAY_MBSC4_MBC112_LEN (1u)

/** \brief  Mask for Ifx_ERAY_MBSC4_Bits.MBC112 */
#define IFX_ERAY_MBSC4_MBC112_MSK (0x1u)

/** \brief  Offset for Ifx_ERAY_MBSC4_Bits.MBC112 */
#define IFX_ERAY_MBSC4_MBC112_OFF (16u)

/** \brief  Length for Ifx_ERAY_MBSC4_Bits.MBC113 */
#define IFX_ERAY_MBSC4_MBC113_LEN (1u)

/** \brief  Mask for Ifx_ERAY_MBSC4_Bits.MBC113 */
#define IFX_ERAY_MBSC4_MBC113_MSK (0x1u)

/** \brief  Offset for Ifx_ERAY_MBSC4_Bits.MBC113 */
#define IFX_ERAY_MBSC4_MBC113_OFF (17u)

/** \brief  Length for Ifx_ERAY_MBSC4_Bits.MBC114 */
#define IFX_ERAY_MBSC4_MBC114_LEN (1u)

/** \brief  Mask for Ifx_ERAY_MBSC4_Bits.MBC114 */
#define IFX_ERAY_MBSC4_MBC114_MSK (0x1u)

/** \brief  Offset for Ifx_ERAY_MBSC4_Bits.MBC114 */
#define IFX_ERAY_MBSC4_MBC114_OFF (18u)

/** \brief  Length for Ifx_ERAY_MBSC4_Bits.MBC115 */
#define IFX_ERAY_MBSC4_MBC115_LEN (1u)

/** \brief  Mask for Ifx_ERAY_MBSC4_Bits.MBC115 */
#define IFX_ERAY_MBSC4_MBC115_MSK (0x1u)

/** \brief  Offset for Ifx_ERAY_MBSC4_Bits.MBC115 */
#define IFX_ERAY_MBSC4_MBC115_OFF (19u)

/** \brief  Length for Ifx_ERAY_MBSC4_Bits.MBC116 */
#define IFX_ERAY_MBSC4_MBC116_LEN (1u)

/** \brief  Mask for Ifx_ERAY_MBSC4_Bits.MBC116 */
#define IFX_ERAY_MBSC4_MBC116_MSK (0x1u)

/** \brief  Offset for Ifx_ERAY_MBSC4_Bits.MBC116 */
#define IFX_ERAY_MBSC4_MBC116_OFF (20u)

