leonNg369/tc234_pxros_bsp_example/bsp/uc/uc_tc23/reg_tc23x_um_v1.1.R1/_Reg/IfxEray_bf.h
/** \brief  Length for Ifx_ERAY_MSIC1_Bits.MSIP13 */
#define IFX_ERAY_MSIC1_MSIP13_LEN (1u)

/** \brief  Mask for Ifx_ERAY_MSIC1_Bits.MSIP13 */
#define IFX_ERAY_MSIC1_MSIP13_MSK (0x1u)

/** \brief  Offset for Ifx_ERAY_MSIC1_Bits.MSIP13 */
#define IFX_ERAY_MSIC1_MSIP13_OFF (13u)

/** \brief  Length for Ifx_ERAY_MSIC1_Bits.MSIP14 */
#define IFX_ERAY_MSIC1_MSIP14_LEN (1u)

/** \brief  Mask for Ifx_ERAY_MSIC1_Bits.MSIP14 */
#define IFX_ERAY_MSIC1_MSIP14_MSK (0x1u)

/** \brief  Offset for Ifx_ERAY_MSIC1_Bits.MSIP14 */
#define IFX_ERAY_MSIC1_MSIP14_OFF (14u)

/** \brief  Length for Ifx_ERAY_MSIC1_Bits.MSIP15 */
#define IFX_ERAY_MSIC1_MSIP15_LEN (1u)

/** \brief  Mask for Ifx_ERAY_MSIC1_Bits.MSIP15 */
#define IFX_ERAY_MSIC1_MSIP15_MSK (0x1u)

/** \brief  Offset for Ifx_ERAY_MSIC1_Bits.MSIP15 */
#define IFX_ERAY_MSIC1_MSIP15_OFF (15u)

/** \brief  Length for Ifx_ERAY_MSIC1_Bits.MSIP16 */
#define IFX_ERAY_MSIC1_MSIP16_LEN (1u)

/** \brief  Mask for Ifx_ERAY_MSIC1_Bits.MSIP16 */
#define IFX_ERAY_MSIC1_MSIP16_MSK (0x1u)

/** \brief  Offset for Ifx_ERAY_MSIC1_Bits.MSIP16 */
#define IFX_ERAY_MSIC1_MSIP16_OFF (16u)

/** \brief  Length for Ifx_ERAY_MSIC1_Bits.MSIP17 */
#define IFX_ERAY_MSIC1_MSIP17_LEN (1u)

/** \brief  Mask for Ifx_ERAY_MSIC1_Bits.MSIP17 */
#define IFX_ERAY_MSIC1_MSIP17_MSK (0x1u)

/** \brief  Offset for Ifx_ERAY_MSIC1_Bits.MSIP17 */
#define IFX_ERAY_MSIC1_MSIP17_OFF (17u)

/** \brief  Length for Ifx_ERAY_MSIC1_Bits.MSIP18 */
#define IFX_ERAY_MSIC1_MSIP18_LEN (1u)

/** \brief  Mask for Ifx_ERAY_MSIC1_Bits.MSIP18 */
#define IFX_ERAY_MSIC1_MSIP18_MSK (0x1u)

/** \brief  Offset for Ifx_ERAY_MSIC1_Bits.MSIP18 */
#define IFX_ERAY_MSIC1_MSIP18_OFF (18u)

/** \brief  Length for Ifx_ERAY_MSIC1_Bits.MSIP19 */
#define IFX_ERAY_MSIC1_MSIP19_LEN (1u)

/** \brief  Mask for Ifx_ERAY_MSIC1_Bits.MSIP19 */
#define IFX_ERAY_MSIC1_MSIP19_MSK (0x1u)

/** \brief  Offset for Ifx_ERAY_MSIC1_Bits.MSIP19 */
#define IFX_ERAY_MSIC1_MSIP19_OFF (19u)

/** \brief  Length for Ifx_ERAY_MSIC1_Bits.MSIP1 */
#define IFX_ERAY_MSIC1_MSIP1_LEN (1u)

/** \brief  Mask for Ifx_ERAY_MSIC1_Bits.MSIP1 */
#define IFX_ERAY_MSIC1_MSIP1_MSK (0x1u)

/** \brief  Offset for Ifx_ERAY_MSIC1_Bits.MSIP1 */
#define IFX_ERAY_MSIC1_MSIP1_OFF (1u)

/** \brief  Length for Ifx_ERAY_MSIC1_Bits.MSIP20 */
#define IFX_ERAY_MSIC1_MSIP20_LEN (1u)

/** \brief  Mask for Ifx_ERAY_MSIC1_Bits.MSIP20 */
#define IFX_ERAY_MSIC1_MSIP20_MSK (0x1u)

/** \brief  Offset for Ifx_ERAY_MSIC1_Bits.MSIP20 */
#define IFX_ERAY_MSIC1_MSIP20_OFF (20u)

/** \brief  Length for Ifx_ERAY_MSIC1_Bits.MSIP21 */
#define IFX_ERAY_MSIC1_MSIP21_LEN (1u)

/** \brief  Mask for Ifx_ERAY_MSIC1_Bits.MSIP21 */
#define IFX_ERAY_MSIC1_MSIP21_MSK (0x1u)

/** \brief  Offset for Ifx_ERAY_MSIC1_Bits.MSIP21 */
#define IFX_ERAY_MSIC1_MSIP21_OFF (21u)

/** \brief  Length for Ifx_ERAY_MSIC1_Bits.MSIP22 */
#define IFX_ERAY_MSIC1_MSIP22_LEN (1u)

/** \brief  Mask for Ifx_ERAY_MSIC1_Bits.MSIP22 */
#define IFX_ERAY_MSIC1_MSIP22_MSK (0x1u)

/** \brief  Offset for Ifx_ERAY_MSIC1_Bits.MSIP22 */
#define IFX_ERAY_MSIC1_MSIP22_OFF (22u)

/** \brief  Length for Ifx_ERAY_MSIC1_Bits.MSIP23 */
#define IFX_ERAY_MSIC1_MSIP23_LEN (1u)

/** \brief  Mask for Ifx_ERAY_MSIC1_Bits.MSIP23 */
#define IFX_ERAY_MSIC1_MSIP23_MSK (0x1u)

/** \brief  Offset for Ifx_ERAY_MSIC1_Bits.MSIP23 */
#define IFX_ERAY_MSIC1_MSIP23_OFF (23u)

/** \brief  Length for Ifx_ERAY_MSIC1_Bits.MSIP24 */
#define IFX_ERAY_MSIC1_MSIP24_LEN (1u)

/** \brief  Mask for Ifx_ERAY_MSIC1_Bits.MSIP24 */
#define IFX_ERAY_MSIC1_MSIP24_MSK (0x1u)

/** \brief  Offset for Ifx_ERAY_MSIC1_Bits.MSIP24 */
#define IFX_ERAY_MSIC1_MSIP24_OFF (24u)

/** \brief  Length for Ifx_ERAY_MSIC1_Bits.MSIP25 */
#define IFX_ERAY_MSIC1_MSIP25_LEN (1u)

/** \brief  Mask for Ifx_ERAY_MSIC1_Bits.MSIP25 */
#define IFX_ERAY_MSIC1_MSIP25_MSK (0x1u)

/** \brief  Offset for Ifx_ERAY_MSIC1_Bits.MSIP25 */
#define IFX_ERAY_MSIC1_MSIP25_OFF (25u)

/** \brief  Length for Ifx_ERAY_MSIC1_Bits.MSIP26 */
#define IFX_ERAY_MSIC1_MSIP26_LEN (1u)

/** \brief  Mask for Ifx_ERAY_MSIC1_Bits.MSIP26 */
#define IFX_ERAY_MSIC1_MSIP26_MSK (0x1u)

/** \brief  Offset for Ifx_ERAY_MSIC1_Bits.MSIP26 */
#define IFX_ERAY_MSIC1_MSIP26_OFF (26u)

/** \brief  Length for Ifx_ERAY_MSIC1_Bits.MSIP27 */
#define IFX_ERAY_MSIC1_MSIP27_LEN (1u)

/** \brief  Mask for Ifx_ERAY_MSIC1_Bits.MSIP27 */
#define IFX_ERAY_MSIC1_MSIP27_MSK (0x1u)

/** \brief  Offset for Ifx_ERAY_MSIC1_Bits.MSIP27 */
#define IFX_ERAY_MSIC1_MSIP27_OFF (27u)

/** \brief  Length for Ifx_ERAY_MSIC1_Bits.MSIP28 */
#define IFX_ERAY_MSIC1_MSIP28_LEN (1u)

/** \brief  Mask for Ifx_ERAY_MSIC1_Bits.MSIP28 */
#define IFX_ERAY_MSIC1_MSIP28_MSK (0x1u)

/** \brief  Offset for Ifx_ERAY_MSIC1_Bits.MSIP28 */
#define IFX_ERAY_MSIC1_MSIP28_OFF (28u)

/** \brief  Length for Ifx_ERAY_MSIC1_Bits.MSIP29 */
#define IFX_ERAY_MSIC1_MSIP29_LEN (1u)

/** \brief  Mask for Ifx_ERAY_MSIC1_Bits.MSIP29 */
#define IFX_ERAY_MSIC1_MSIP29_MSK (0x1u)

/** \brief  Offset for Ifx_ERAY_MSIC1_Bits.MSIP29 */
#define IFX_ERAY_MSIC1_MSIP29_OFF (29u)

/** \brief  Length for Ifx_ERAY_MSIC1_Bits.MSIP2 */
#define IFX_ERAY_MSIC1_MSIP2_LEN (1u)

/** \brief  Mask for Ifx_ERAY_MSIC1_Bits.MSIP2 */
#define IFX_ERAY_MSIC1_MSIP2_MSK (0x1u)

/** \brief  Offset for Ifx_ERAY_MSIC1_Bits.MSIP2 */
#define IFX_ERAY_MSIC1_MSIP2_OFF (2u)

/** \brief  Length for Ifx_ERAY_MSIC1_Bits.MSIP30 */
#define IFX_ERAY_MSIC1_MSIP30_LEN (1u)

/** \brief  Mask for Ifx_ERAY_MSIC1_Bits.MSIP30 */
#define IFX_ERAY_MSIC1_MSIP30_MSK (0x1u)

/** \brief  Offset for Ifx_ERAY_MSIC1_Bits.MSIP30 */
#define IFX_ERAY_MSIC1_MSIP30_OFF (30u)

/** \brief  Length for Ifx_ERAY_MSIC1_Bits.MSIP31 */
#define IFX_ERAY_MSIC1_MSIP31_LEN (1u)

/** \brief  Mask for Ifx_ERAY_MSIC1_Bits.MSIP31 */
#define IFX_ERAY_MSIC1_MSIP31_MSK (0x1u)

/** \brief  Offset for Ifx_ERAY_MSIC1_Bits.MSIP31 */
#define IFX_ERAY_MSIC1_MSIP31_OFF (31u)

/** \brief  Length for Ifx_ERAY_MSIC1_Bits.MSIP3 */
#define IFX_ERAY_MSIC1_MSIP3_LEN (1u)

/** \brief  Mask for Ifx_ERAY_MSIC1_Bits.MSIP3 */
#define IFX_ERAY_MSIC1_MSIP3_MSK (0x1u)

/** \brief  Offset for Ifx_ERAY_MSIC1_Bits.MSIP3 */
#define IFX_ERAY_MSIC1_MSIP3_OFF (3u)

/** \brief  Length for Ifx_ERAY_MSIC1_Bits.MSIP4 */
#define IFX_ERAY_MSIC1_MSIP4_LEN (1u)

/** \brief  Mask for Ifx_ERAY_MSIC1_Bits.MSIP4 */
#define IFX_ERAY_MSIC1_MSIP4_MSK (0x1u)

/** \brief  Offset for Ifx_ERAY_MSIC1_Bits.MSIP4 */
#define IFX_ERAY_MSIC1_MSIP4_OFF (4u)

/** \brief  Length for Ifx_ERAY_MSIC1_Bits.MSIP5 */
#define IFX_ERAY_MSIC1_MSIP5_LEN (1u)

/** \brief  Mask for Ifx_ERAY_MSIC1_Bits.MSIP5 */
#define IFX_ERAY_MSIC1_MSIP5_MSK (0x1u)

/** \brief  Offset for Ifx_ERAY_MSIC1_Bits.MSIP5 */
#define IFX_ERAY_MSIC1_MSIP5_OFF (5u)

/** \brief  Length for Ifx_ERAY_MSIC1_Bits.MSIP6 */
#define IFX_ERAY_MSIC1_MSIP6_LEN (1u)

