leonNg369/tc234_pxros_bsp_example/bsp/uc/uc_tc23/reg_tc23x_um_v1.1.R1/_Reg/IfxEray_bf.h
/** \brief  Mask for Ifx_ERAY_MSIC4_Bits.MSIP121 */
#define IFX_ERAY_MSIC4_MSIP121_MSK (0x1u)

/** \brief  Offset for Ifx_ERAY_MSIC4_Bits.MSIP121 */
#define IFX_ERAY_MSIC4_MSIP121_OFF (25u)

/** \brief  Length for Ifx_ERAY_MSIC4_Bits.MSIP122 */
#define IFX_ERAY_MSIC4_MSIP122_LEN (1u)

/** \brief  Mask for Ifx_ERAY_MSIC4_Bits.MSIP122 */
#define IFX_ERAY_MSIC4_MSIP122_MSK (0x1u)

/** \brief  Offset for Ifx_ERAY_MSIC4_Bits.MSIP122 */
#define IFX_ERAY_MSIC4_MSIP122_OFF (26u)

/** \brief  Length for Ifx_ERAY_MSIC4_Bits.MSIP123 */
#define IFX_ERAY_MSIC4_MSIP123_LEN (1u)

/** \brief  Mask for Ifx_ERAY_MSIC4_Bits.MSIP123 */
#define IFX_ERAY_MSIC4_MSIP123_MSK (0x1u)

/** \brief  Offset for Ifx_ERAY_MSIC4_Bits.MSIP123 */
#define IFX_ERAY_MSIC4_MSIP123_OFF (27u)

/** \brief  Length for Ifx_ERAY_MSIC4_Bits.MSIP124 */
#define IFX_ERAY_MSIC4_MSIP124_LEN (1u)

/** \brief  Mask for Ifx_ERAY_MSIC4_Bits.MSIP124 */
#define IFX_ERAY_MSIC4_MSIP124_MSK (0x1u)

/** \brief  Offset for Ifx_ERAY_MSIC4_Bits.MSIP124 */
#define IFX_ERAY_MSIC4_MSIP124_OFF (28u)

/** \brief  Length for Ifx_ERAY_MSIC4_Bits.MSIP125 */
#define IFX_ERAY_MSIC4_MSIP125_LEN (1u)

/** \brief  Mask for Ifx_ERAY_MSIC4_Bits.MSIP125 */
#define IFX_ERAY_MSIC4_MSIP125_MSK (0x1u)

/** \brief  Offset for Ifx_ERAY_MSIC4_Bits.MSIP125 */
#define IFX_ERAY_MSIC4_MSIP125_OFF (29u)

/** \brief  Length for Ifx_ERAY_MSIC4_Bits.MSIP126 */
#define IFX_ERAY_MSIC4_MSIP126_LEN (1u)

/** \brief  Mask for Ifx_ERAY_MSIC4_Bits.MSIP126 */
#define IFX_ERAY_MSIC4_MSIP126_MSK (0x1u)

/** \brief  Offset for Ifx_ERAY_MSIC4_Bits.MSIP126 */
#define IFX_ERAY_MSIC4_MSIP126_OFF (30u)

/** \brief  Length for Ifx_ERAY_MSIC4_Bits.MSIP127 */
#define IFX_ERAY_MSIC4_MSIP127_LEN (1u)

/** \brief  Mask for Ifx_ERAY_MSIC4_Bits.MSIP127 */
#define IFX_ERAY_MSIC4_MSIP127_MSK (0x1u)

/** \brief  Offset for Ifx_ERAY_MSIC4_Bits.MSIP127 */
#define IFX_ERAY_MSIC4_MSIP127_OFF (31u)

/** \brief  Length for Ifx_ERAY_MSIC4_Bits.MSIP96 */
#define IFX_ERAY_MSIC4_MSIP96_LEN (1u)

/** \brief  Mask for Ifx_ERAY_MSIC4_Bits.MSIP96 */
#define IFX_ERAY_MSIC4_MSIP96_MSK (0x1u)

/** \brief  Offset for Ifx_ERAY_MSIC4_Bits.MSIP96 */
#define IFX_ERAY_MSIC4_MSIP96_OFF (0u)

/** \brief  Length for Ifx_ERAY_MSIC4_Bits.MSIP97 */
#define IFX_ERAY_MSIC4_MSIP97_LEN (1u)

/** \brief  Mask for Ifx_ERAY_MSIC4_Bits.MSIP97 */
#define IFX_ERAY_MSIC4_MSIP97_MSK (0x1u)

/** \brief  Offset for Ifx_ERAY_MSIC4_Bits.MSIP97 */
#define IFX_ERAY_MSIC4_MSIP97_OFF (1u)

/** \brief  Length for Ifx_ERAY_MSIC4_Bits.MSIP98 */
#define IFX_ERAY_MSIC4_MSIP98_LEN (1u)

/** \brief  Mask for Ifx_ERAY_MSIC4_Bits.MSIP98 */
#define IFX_ERAY_MSIC4_MSIP98_MSK (0x1u)

/** \brief  Offset for Ifx_ERAY_MSIC4_Bits.MSIP98 */
#define IFX_ERAY_MSIC4_MSIP98_OFF (2u)

/** \brief  Length for Ifx_ERAY_MSIC4_Bits.MSIP99 */
#define IFX_ERAY_MSIC4_MSIP99_LEN (1u)

/** \brief  Mask for Ifx_ERAY_MSIC4_Bits.MSIP99 */
#define IFX_ERAY_MSIC4_MSIP99_MSK (0x1u)

/** \brief  Offset for Ifx_ERAY_MSIC4_Bits.MSIP99 */
#define IFX_ERAY_MSIC4_MSIP99_OFF (3u)

/** \brief  Length for Ifx_ERAY_MTCCV_Bits.CCV */
#define IFX_ERAY_MTCCV_CCV_LEN (6u)

/** \brief  Mask for Ifx_ERAY_MTCCV_Bits.CCV */
#define IFX_ERAY_MTCCV_CCV_MSK (0x3fu)

/** \brief  Offset for Ifx_ERAY_MTCCV_Bits.CCV */
#define IFX_ERAY_MTCCV_CCV_OFF (16u)

/** \brief  Length for Ifx_ERAY_MTCCV_Bits.MTV */
#define IFX_ERAY_MTCCV_MTV_LEN (14u)

/** \brief  Mask for Ifx_ERAY_MTCCV_Bits.MTV */
#define IFX_ERAY_MTCCV_MTV_MSK (0x3fffu)

/** \brief  Offset for Ifx_ERAY_MTCCV_Bits.MTV */
#define IFX_ERAY_MTCCV_MTV_OFF (0u)

/** \brief  Length for Ifx_ERAY_NDAT1_Bits.ND0 */
#define IFX_ERAY_NDAT1_ND0_LEN (1u)

/** \brief  Mask for Ifx_ERAY_NDAT1_Bits.ND0 */
#define IFX_ERAY_NDAT1_ND0_MSK (0x1u)

/** \brief  Offset for Ifx_ERAY_NDAT1_Bits.ND0 */
#define IFX_ERAY_NDAT1_ND0_OFF (0u)

/** \brief  Length for Ifx_ERAY_NDAT1_Bits.ND10 */
#define IFX_ERAY_NDAT1_ND10_LEN (1u)

/** \brief  Mask for Ifx_ERAY_NDAT1_Bits.ND10 */
#define IFX_ERAY_NDAT1_ND10_MSK (0x1u)

/** \brief  Offset for Ifx_ERAY_NDAT1_Bits.ND10 */
#define IFX_ERAY_NDAT1_ND10_OFF (10u)

/** \brief  Length for Ifx_ERAY_NDAT1_Bits.ND11 */
#define IFX_ERAY_NDAT1_ND11_LEN (1u)

/** \brief  Mask for Ifx_ERAY_NDAT1_Bits.ND11 */
#define IFX_ERAY_NDAT1_ND11_MSK (0x1u)

/** \brief  Offset for Ifx_ERAY_NDAT1_Bits.ND11 */
#define IFX_ERAY_NDAT1_ND11_OFF (11u)

/** \brief  Length for Ifx_ERAY_NDAT1_Bits.ND12 */
#define IFX_ERAY_NDAT1_ND12_LEN (1u)

/** \brief  Mask for Ifx_ERAY_NDAT1_Bits.ND12 */
#define IFX_ERAY_NDAT1_ND12_MSK (0x1u)

/** \brief  Offset for Ifx_ERAY_NDAT1_Bits.ND12 */
#define IFX_ERAY_NDAT1_ND12_OFF (12u)

/** \brief  Length for Ifx_ERAY_NDAT1_Bits.ND13 */
#define IFX_ERAY_NDAT1_ND13_LEN (1u)

/** \brief  Mask for Ifx_ERAY_NDAT1_Bits.ND13 */
#define IFX_ERAY_NDAT1_ND13_MSK (0x1u)

/** \brief  Offset for Ifx_ERAY_NDAT1_Bits.ND13 */
#define IFX_ERAY_NDAT1_ND13_OFF (13u)

/** \brief  Length for Ifx_ERAY_NDAT1_Bits.ND14 */
#define IFX_ERAY_NDAT1_ND14_LEN (1u)

/** \brief  Mask for Ifx_ERAY_NDAT1_Bits.ND14 */
#define IFX_ERAY_NDAT1_ND14_MSK (0x1u)

/** \brief  Offset for Ifx_ERAY_NDAT1_Bits.ND14 */
#define IFX_ERAY_NDAT1_ND14_OFF (14u)

/** \brief  Length for Ifx_ERAY_NDAT1_Bits.ND15 */
#define IFX_ERAY_NDAT1_ND15_LEN (1u)

/** \brief  Mask for Ifx_ERAY_NDAT1_Bits.ND15 */
#define IFX_ERAY_NDAT1_ND15_MSK (0x1u)

/** \brief  Offset for Ifx_ERAY_NDAT1_Bits.ND15 */
#define IFX_ERAY_NDAT1_ND15_OFF (15u)

/** \brief  Length for Ifx_ERAY_NDAT1_Bits.ND16 */
#define IFX_ERAY_NDAT1_ND16_LEN (1u)

/** \brief  Mask for Ifx_ERAY_NDAT1_Bits.ND16 */
#define IFX_ERAY_NDAT1_ND16_MSK (0x1u)

/** \brief  Offset for Ifx_ERAY_NDAT1_Bits.ND16 */
#define IFX_ERAY_NDAT1_ND16_OFF (16u)

/** \brief  Length for Ifx_ERAY_NDAT1_Bits.ND17 */
#define IFX_ERAY_NDAT1_ND17_LEN (1u)

/** \brief  Mask for Ifx_ERAY_NDAT1_Bits.ND17 */
#define IFX_ERAY_NDAT1_ND17_MSK (0x1u)

/** \brief  Offset for Ifx_ERAY_NDAT1_Bits.ND17 */
#define IFX_ERAY_NDAT1_ND17_OFF (17u)

/** \brief  Length for Ifx_ERAY_NDAT1_Bits.ND18 */
#define IFX_ERAY_NDAT1_ND18_LEN (1u)

/** \brief  Mask for Ifx_ERAY_NDAT1_Bits.ND18 */
#define IFX_ERAY_NDAT1_ND18_MSK (0x1u)

