leonNg369/tc234_pxros_bsp_example/bsp/uc/uc_tc23/reg_tc23x_um_v1.1.R1/_Reg/IfxEray_bf.h
/** \brief  Offset for Ifx_ERAY_NDAT1_Bits.ND18 */
#define IFX_ERAY_NDAT1_ND18_OFF (18u)

/** \brief  Length for Ifx_ERAY_NDAT1_Bits.ND19 */
#define IFX_ERAY_NDAT1_ND19_LEN (1u)

/** \brief  Mask for Ifx_ERAY_NDAT1_Bits.ND19 */
#define IFX_ERAY_NDAT1_ND19_MSK (0x1u)

/** \brief  Offset for Ifx_ERAY_NDAT1_Bits.ND19 */
#define IFX_ERAY_NDAT1_ND19_OFF (19u)

/** \brief  Length for Ifx_ERAY_NDAT1_Bits.ND1 */
#define IFX_ERAY_NDAT1_ND1_LEN (1u)

/** \brief  Mask for Ifx_ERAY_NDAT1_Bits.ND1 */
#define IFX_ERAY_NDAT1_ND1_MSK (0x1u)

/** \brief  Offset for Ifx_ERAY_NDAT1_Bits.ND1 */
#define IFX_ERAY_NDAT1_ND1_OFF (1u)

/** \brief  Length for Ifx_ERAY_NDAT1_Bits.ND20 */
#define IFX_ERAY_NDAT1_ND20_LEN (1u)

/** \brief  Mask for Ifx_ERAY_NDAT1_Bits.ND20 */
#define IFX_ERAY_NDAT1_ND20_MSK (0x1u)

/** \brief  Offset for Ifx_ERAY_NDAT1_Bits.ND20 */
#define IFX_ERAY_NDAT1_ND20_OFF (20u)

/** \brief  Length for Ifx_ERAY_NDAT1_Bits.ND21 */
#define IFX_ERAY_NDAT1_ND21_LEN (1u)

/** \brief  Mask for Ifx_ERAY_NDAT1_Bits.ND21 */
#define IFX_ERAY_NDAT1_ND21_MSK (0x1u)

/** \brief  Offset for Ifx_ERAY_NDAT1_Bits.ND21 */
#define IFX_ERAY_NDAT1_ND21_OFF (21u)

/** \brief  Length for Ifx_ERAY_NDAT1_Bits.ND22 */
#define IFX_ERAY_NDAT1_ND22_LEN (1u)

/** \brief  Mask for Ifx_ERAY_NDAT1_Bits.ND22 */
#define IFX_ERAY_NDAT1_ND22_MSK (0x1u)

/** \brief  Offset for Ifx_ERAY_NDAT1_Bits.ND22 */
#define IFX_ERAY_NDAT1_ND22_OFF (22u)

/** \brief  Length for Ifx_ERAY_NDAT1_Bits.ND23 */
#define IFX_ERAY_NDAT1_ND23_LEN (1u)

/** \brief  Mask for Ifx_ERAY_NDAT1_Bits.ND23 */
#define IFX_ERAY_NDAT1_ND23_MSK (0x1u)

/** \brief  Offset for Ifx_ERAY_NDAT1_Bits.ND23 */
#define IFX_ERAY_NDAT1_ND23_OFF (23u)

/** \brief  Length for Ifx_ERAY_NDAT1_Bits.ND24 */
#define IFX_ERAY_NDAT1_ND24_LEN (1u)

/** \brief  Mask for Ifx_ERAY_NDAT1_Bits.ND24 */
#define IFX_ERAY_NDAT1_ND24_MSK (0x1u)

/** \brief  Offset for Ifx_ERAY_NDAT1_Bits.ND24 */
#define IFX_ERAY_NDAT1_ND24_OFF (24u)

/** \brief  Length for Ifx_ERAY_NDAT1_Bits.ND25 */
#define IFX_ERAY_NDAT1_ND25_LEN (1u)

/** \brief  Mask for Ifx_ERAY_NDAT1_Bits.ND25 */
#define IFX_ERAY_NDAT1_ND25_MSK (0x1u)

/** \brief  Offset for Ifx_ERAY_NDAT1_Bits.ND25 */
#define IFX_ERAY_NDAT1_ND25_OFF (25u)

/** \brief  Length for Ifx_ERAY_NDAT1_Bits.ND26 */
#define IFX_ERAY_NDAT1_ND26_LEN (1u)

/** \brief  Mask for Ifx_ERAY_NDAT1_Bits.ND26 */
#define IFX_ERAY_NDAT1_ND26_MSK (0x1u)

/** \brief  Offset for Ifx_ERAY_NDAT1_Bits.ND26 */
#define IFX_ERAY_NDAT1_ND26_OFF (26u)

/** \brief  Length for Ifx_ERAY_NDAT1_Bits.ND27 */
#define IFX_ERAY_NDAT1_ND27_LEN (1u)

/** \brief  Mask for Ifx_ERAY_NDAT1_Bits.ND27 */
#define IFX_ERAY_NDAT1_ND27_MSK (0x1u)

/** \brief  Offset for Ifx_ERAY_NDAT1_Bits.ND27 */
#define IFX_ERAY_NDAT1_ND27_OFF (27u)

/** \brief  Length for Ifx_ERAY_NDAT1_Bits.ND28 */
#define IFX_ERAY_NDAT1_ND28_LEN (1u)

/** \brief  Mask for Ifx_ERAY_NDAT1_Bits.ND28 */
#define IFX_ERAY_NDAT1_ND28_MSK (0x1u)

/** \brief  Offset for Ifx_ERAY_NDAT1_Bits.ND28 */
#define IFX_ERAY_NDAT1_ND28_OFF (28u)

/** \brief  Length for Ifx_ERAY_NDAT1_Bits.ND29 */
#define IFX_ERAY_NDAT1_ND29_LEN (1u)

/** \brief  Mask for Ifx_ERAY_NDAT1_Bits.ND29 */
#define IFX_ERAY_NDAT1_ND29_MSK (0x1u)

/** \brief  Offset for Ifx_ERAY_NDAT1_Bits.ND29 */
#define IFX_ERAY_NDAT1_ND29_OFF (29u)

/** \brief  Length for Ifx_ERAY_NDAT1_Bits.ND2 */
#define IFX_ERAY_NDAT1_ND2_LEN (1u)

/** \brief  Mask for Ifx_ERAY_NDAT1_Bits.ND2 */
#define IFX_ERAY_NDAT1_ND2_MSK (0x1u)

/** \brief  Offset for Ifx_ERAY_NDAT1_Bits.ND2 */
#define IFX_ERAY_NDAT1_ND2_OFF (2u)

/** \brief  Length for Ifx_ERAY_NDAT1_Bits.ND30 */
#define IFX_ERAY_NDAT1_ND30_LEN (1u)

/** \brief  Mask for Ifx_ERAY_NDAT1_Bits.ND30 */
#define IFX_ERAY_NDAT1_ND30_MSK (0x1u)

/** \brief  Offset for Ifx_ERAY_NDAT1_Bits.ND30 */
#define IFX_ERAY_NDAT1_ND30_OFF (30u)

/** \brief  Length for Ifx_ERAY_NDAT1_Bits.ND31 */
#define IFX_ERAY_NDAT1_ND31_LEN (1u)

/** \brief  Mask for Ifx_ERAY_NDAT1_Bits.ND31 */
#define IFX_ERAY_NDAT1_ND31_MSK (0x1u)

/** \brief  Offset for Ifx_ERAY_NDAT1_Bits.ND31 */
#define IFX_ERAY_NDAT1_ND31_OFF (31u)

/** \brief  Length for Ifx_ERAY_NDAT1_Bits.ND3 */
#define IFX_ERAY_NDAT1_ND3_LEN (1u)

/** \brief  Mask for Ifx_ERAY_NDAT1_Bits.ND3 */
#define IFX_ERAY_NDAT1_ND3_MSK (0x1u)

/** \brief  Offset for Ifx_ERAY_NDAT1_Bits.ND3 */
#define IFX_ERAY_NDAT1_ND3_OFF (3u)

/** \brief  Length for Ifx_ERAY_NDAT1_Bits.ND4 */
#define IFX_ERAY_NDAT1_ND4_LEN (1u)

/** \brief  Mask for Ifx_ERAY_NDAT1_Bits.ND4 */
#define IFX_ERAY_NDAT1_ND4_MSK (0x1u)

/** \brief  Offset for Ifx_ERAY_NDAT1_Bits.ND4 */
#define IFX_ERAY_NDAT1_ND4_OFF (4u)

/** \brief  Length for Ifx_ERAY_NDAT1_Bits.ND5 */
#define IFX_ERAY_NDAT1_ND5_LEN (1u)

/** \brief  Mask for Ifx_ERAY_NDAT1_Bits.ND5 */
#define IFX_ERAY_NDAT1_ND5_MSK (0x1u)

/** \brief  Offset for Ifx_ERAY_NDAT1_Bits.ND5 */
#define IFX_ERAY_NDAT1_ND5_OFF (5u)

/** \brief  Length for Ifx_ERAY_NDAT1_Bits.ND6 */
#define IFX_ERAY_NDAT1_ND6_LEN (1u)

/** \brief  Mask for Ifx_ERAY_NDAT1_Bits.ND6 */
#define IFX_ERAY_NDAT1_ND6_MSK (0x1u)

/** \brief  Offset for Ifx_ERAY_NDAT1_Bits.ND6 */
#define IFX_ERAY_NDAT1_ND6_OFF (6u)

/** \brief  Length for Ifx_ERAY_NDAT1_Bits.ND7 */
#define IFX_ERAY_NDAT1_ND7_LEN (1u)

/** \brief  Mask for Ifx_ERAY_NDAT1_Bits.ND7 */
#define IFX_ERAY_NDAT1_ND7_MSK (0x1u)

/** \brief  Offset for Ifx_ERAY_NDAT1_Bits.ND7 */
#define IFX_ERAY_NDAT1_ND7_OFF (7u)

/** \brief  Length for Ifx_ERAY_NDAT1_Bits.ND8 */
#define IFX_ERAY_NDAT1_ND8_LEN (1u)

/** \brief  Mask for Ifx_ERAY_NDAT1_Bits.ND8 */
#define IFX_ERAY_NDAT1_ND8_MSK (0x1u)

/** \brief  Offset for Ifx_ERAY_NDAT1_Bits.ND8 */
#define IFX_ERAY_NDAT1_ND8_OFF (8u)

/** \brief  Length for Ifx_ERAY_NDAT1_Bits.ND9 */
#define IFX_ERAY_NDAT1_ND9_LEN (1u)

/** \brief  Mask for Ifx_ERAY_NDAT1_Bits.ND9 */
#define IFX_ERAY_NDAT1_ND9_MSK (0x1u)

/** \brief  Offset for Ifx_ERAY_NDAT1_Bits.ND9 */
#define IFX_ERAY_NDAT1_ND9_OFF (9u)

/** \brief  Length for Ifx_ERAY_NDAT2_Bits.ND32 */
#define IFX_ERAY_NDAT2_ND32_LEN (1u)

/** \brief  Mask for Ifx_ERAY_NDAT2_Bits.ND32 */
#define IFX_ERAY_NDAT2_ND32_MSK (0x1u)

/** \brief  Offset for Ifx_ERAY_NDAT2_Bits.ND32 */
#define IFX_ERAY_NDAT2_ND32_OFF (0u)

