leonNg369/tc234_pxros_bsp_example/bsp/uc/uc_tc23/reg_tc23x_um_v1.1.R1/_Reg/IfxEray_bf.h
/** \brief  Mask for Ifx_ERAY_NMV_Bits.NM */
#define IFX_ERAY_NMV_NM_MSK (0xffffffffu)

/** \brief  Offset for Ifx_ERAY_NMV_Bits.NM */
#define IFX_ERAY_NMV_NM_OFF (0u)

/** \brief  Length for Ifx_ERAY_OBCM_Bits.RDSH */
#define IFX_ERAY_OBCM_RDSH_LEN (1u)

/** \brief  Mask for Ifx_ERAY_OBCM_Bits.RDSH */
#define IFX_ERAY_OBCM_RDSH_MSK (0x1u)

/** \brief  Offset for Ifx_ERAY_OBCM_Bits.RDSH */
#define IFX_ERAY_OBCM_RDSH_OFF (17u)

/** \brief  Length for Ifx_ERAY_OBCM_Bits.RDSS */
#define IFX_ERAY_OBCM_RDSS_LEN (1u)

/** \brief  Mask for Ifx_ERAY_OBCM_Bits.RDSS */
#define IFX_ERAY_OBCM_RDSS_MSK (0x1u)

/** \brief  Offset for Ifx_ERAY_OBCM_Bits.RDSS */
#define IFX_ERAY_OBCM_RDSS_OFF (1u)

/** \brief  Length for Ifx_ERAY_OBCM_Bits.RHSH */
#define IFX_ERAY_OBCM_RHSH_LEN (1u)

/** \brief  Mask for Ifx_ERAY_OBCM_Bits.RHSH */
#define IFX_ERAY_OBCM_RHSH_MSK (0x1u)

/** \brief  Offset for Ifx_ERAY_OBCM_Bits.RHSH */
#define IFX_ERAY_OBCM_RHSH_OFF (16u)

/** \brief  Length for Ifx_ERAY_OBCM_Bits.RHSS */
#define IFX_ERAY_OBCM_RHSS_LEN (1u)

/** \brief  Mask for Ifx_ERAY_OBCM_Bits.RHSS */
#define IFX_ERAY_OBCM_RHSS_MSK (0x1u)

/** \brief  Offset for Ifx_ERAY_OBCM_Bits.RHSS */
#define IFX_ERAY_OBCM_RHSS_OFF (0u)

/** \brief  Length for Ifx_ERAY_OBCR_Bits.OBRH */
#define IFX_ERAY_OBCR_OBRH_LEN (7u)

/** \brief  Mask for Ifx_ERAY_OBCR_Bits.OBRH */
#define IFX_ERAY_OBCR_OBRH_MSK (0x7fu)

/** \brief  Offset for Ifx_ERAY_OBCR_Bits.OBRH */
#define IFX_ERAY_OBCR_OBRH_OFF (16u)

/** \brief  Length for Ifx_ERAY_OBCR_Bits.OBRS */
#define IFX_ERAY_OBCR_OBRS_LEN (7u)

/** \brief  Mask for Ifx_ERAY_OBCR_Bits.OBRS */
#define IFX_ERAY_OBCR_OBRS_MSK (0x7fu)

/** \brief  Offset for Ifx_ERAY_OBCR_Bits.OBRS */
#define IFX_ERAY_OBCR_OBRS_OFF (0u)

/** \brief  Length for Ifx_ERAY_OBCR_Bits.OBSYS */
#define IFX_ERAY_OBCR_OBSYS_LEN (1u)

/** \brief  Mask for Ifx_ERAY_OBCR_Bits.OBSYS */
#define IFX_ERAY_OBCR_OBSYS_MSK (0x1u)

/** \brief  Offset for Ifx_ERAY_OBCR_Bits.OBSYS */
#define IFX_ERAY_OBCR_OBSYS_OFF (15u)

/** \brief  Length for Ifx_ERAY_OBCR_Bits.REQ */
#define IFX_ERAY_OBCR_REQ_LEN (1u)

/** \brief  Mask for Ifx_ERAY_OBCR_Bits.REQ */
#define IFX_ERAY_OBCR_REQ_MSK (0x1u)

/** \brief  Offset for Ifx_ERAY_OBCR_Bits.REQ */
#define IFX_ERAY_OBCR_REQ_OFF (9u)

/** \brief  Length for Ifx_ERAY_OBCR_Bits.VIEW */
#define IFX_ERAY_OBCR_VIEW_LEN (1u)

/** \brief  Mask for Ifx_ERAY_OBCR_Bits.VIEW */
#define IFX_ERAY_OBCR_VIEW_MSK (0x1u)

/** \brief  Offset for Ifx_ERAY_OBCR_Bits.VIEW */
#define IFX_ERAY_OBCR_VIEW_OFF (8u)

/** \brief  Length for Ifx_ERAY_OCS_Bits.SUS */
#define IFX_ERAY_OCS_SUS_LEN (4u)

/** \brief  Mask for Ifx_ERAY_OCS_Bits.SUS */
#define IFX_ERAY_OCS_SUS_MSK (0xfu)

/** \brief  Offset for Ifx_ERAY_OCS_Bits.SUS */
#define IFX_ERAY_OCS_SUS_OFF (24u)

/** \brief  Length for Ifx_ERAY_OCS_Bits.SUS_P */
#define IFX_ERAY_OCS_SUS_P_LEN (1u)

/** \brief  Mask for Ifx_ERAY_OCS_Bits.SUS_P */
#define IFX_ERAY_OCS_SUS_P_MSK (0x1u)

/** \brief  Offset for Ifx_ERAY_OCS_Bits.SUS_P */
#define IFX_ERAY_OCS_SUS_P_OFF (28u)

/** \brief  Length for Ifx_ERAY_OCS_Bits.SUSSTA */
#define IFX_ERAY_OCS_SUSSTA_LEN (1u)

/** \brief  Mask for Ifx_ERAY_OCS_Bits.SUSSTA */
#define IFX_ERAY_OCS_SUSSTA_MSK (0x1u)

/** \brief  Offset for Ifx_ERAY_OCS_Bits.SUSSTA */
#define IFX_ERAY_OCS_SUSSTA_OFF (29u)

/** \brief  Length for Ifx_ERAY_OCV_Bits.OCV */
#define IFX_ERAY_OCV_OCV_LEN (19u)

/** \brief  Mask for Ifx_ERAY_OCV_Bits.OCV */
#define IFX_ERAY_OCV_OCV_MSK (0x7ffffu)

/** \brief  Offset for Ifx_ERAY_OCV_Bits.OCV */
#define IFX_ERAY_OCV_OCV_OFF (0u)

/** \brief  Length for Ifx_ERAY_OSID_Bits.OID */
#define IFX_ERAY_OSID_OID_LEN (10u)

/** \brief  Mask for Ifx_ERAY_OSID_Bits.OID */
#define IFX_ERAY_OSID_OID_MSK (0x3ffu)

/** \brief  Offset for Ifx_ERAY_OSID_Bits.OID */
#define IFX_ERAY_OSID_OID_OFF (0u)

/** \brief  Length for Ifx_ERAY_OSID_Bits.RXOA */
#define IFX_ERAY_OSID_RXOA_LEN (1u)

/** \brief  Mask for Ifx_ERAY_OSID_Bits.RXOA */
#define IFX_ERAY_OSID_RXOA_MSK (0x1u)

/** \brief  Offset for Ifx_ERAY_OSID_Bits.RXOA */
#define IFX_ERAY_OSID_RXOA_OFF (14u)

/** \brief  Length for Ifx_ERAY_OSID_Bits.RXOB */
#define IFX_ERAY_OSID_RXOB_LEN (1u)

/** \brief  Mask for Ifx_ERAY_OSID_Bits.RXOB */
#define IFX_ERAY_OSID_RXOB_MSK (0x1u)

/** \brief  Offset for Ifx_ERAY_OSID_Bits.RXOB */
#define IFX_ERAY_OSID_RXOB_OFF (15u)

/** \brief  Length for Ifx_ERAY_OTSS_Bits.OTGB0 */
#define IFX_ERAY_OTSS_OTGB0_LEN (2u)

/** \brief  Mask for Ifx_ERAY_OTSS_Bits.OTGB0 */
#define IFX_ERAY_OTSS_OTGB0_MSK (0x3u)

/** \brief  Offset for Ifx_ERAY_OTSS_Bits.OTGB0 */
#define IFX_ERAY_OTSS_OTGB0_OFF (0u)

/** \brief  Length for Ifx_ERAY_OTSS_Bits.OTGB1 */
#define IFX_ERAY_OTSS_OTGB1_LEN (2u)

/** \brief  Mask for Ifx_ERAY_OTSS_Bits.OTGB1 */
#define IFX_ERAY_OTSS_OTGB1_MSK (0x3u)

/** \brief  Offset for Ifx_ERAY_OTSS_Bits.OTGB1 */
#define IFX_ERAY_OTSS_OTGB1_OFF (8u)

/** \brief  Length for Ifx_ERAY_OTSS_Bits.OTGB2 */
#define IFX_ERAY_OTSS_OTGB2_LEN (1u)

/** \brief  Mask for Ifx_ERAY_OTSS_Bits.OTGB2 */
#define IFX_ERAY_OTSS_OTGB2_MSK (0x1u)

/** \brief  Offset for Ifx_ERAY_OTSS_Bits.OTGB2 */
#define IFX_ERAY_OTSS_OTGB2_OFF (16u)

/** \brief  Length for Ifx_ERAY_PRTC1_Bits.BRP */
#define IFX_ERAY_PRTC1_BRP_LEN (2u)

/** \brief  Mask for Ifx_ERAY_PRTC1_Bits.BRP */
#define IFX_ERAY_PRTC1_BRP_MSK (0x3u)

/** \brief  Offset for Ifx_ERAY_PRTC1_Bits.BRP */
#define IFX_ERAY_PRTC1_BRP_OFF (14u)

/** \brief  Length for Ifx_ERAY_PRTC1_Bits.CASM */
#define IFX_ERAY_PRTC1_CASM_LEN (7u)

/** \brief  Mask for Ifx_ERAY_PRTC1_Bits.CASM */
#define IFX_ERAY_PRTC1_CASM_MSK (0x7fu)

/** \brief  Offset for Ifx_ERAY_PRTC1_Bits.CASM */
#define IFX_ERAY_PRTC1_CASM_OFF (4u)

/** \brief  Length for Ifx_ERAY_PRTC1_Bits.RWP */
#define IFX_ERAY_PRTC1_RWP_LEN (6u)

/** \brief  Mask for Ifx_ERAY_PRTC1_Bits.RWP */
#define IFX_ERAY_PRTC1_RWP_MSK (0x3fu)

/** \brief  Offset for Ifx_ERAY_PRTC1_Bits.RWP */
#define IFX_ERAY_PRTC1_RWP_OFF (26u)

/** \brief  Length for Ifx_ERAY_PRTC1_Bits.RXW */
#define IFX_ERAY_PRTC1_RXW_LEN (9u)

/** \brief  Mask for Ifx_ERAY_PRTC1_Bits.RXW */
#define IFX_ERAY_PRTC1_RXW_MSK (0x1ffu)

/** \brief  Offset for Ifx_ERAY_PRTC1_Bits.RXW */
#define IFX_ERAY_PRTC1_RXW_OFF (16u)

