leonNg369/tc234_pxros_bsp_example/bsp/uc/uc_tc23/reg_tc23x_um_v1.1.R1/_Reg/IfxEray_bf.h
/** \brief  Length for Ifx_ERAY_PRTC1_Bits.SPP */
#define IFX_ERAY_PRTC1_SPP_LEN (2u)

/** \brief  Mask for Ifx_ERAY_PRTC1_Bits.SPP */
#define IFX_ERAY_PRTC1_SPP_MSK (0x3u)

/** \brief  Offset for Ifx_ERAY_PRTC1_Bits.SPP */
#define IFX_ERAY_PRTC1_SPP_OFF (12u)

/** \brief  Length for Ifx_ERAY_PRTC1_Bits.TSST */
#define IFX_ERAY_PRTC1_TSST_LEN (4u)

/** \brief  Mask for Ifx_ERAY_PRTC1_Bits.TSST */
#define IFX_ERAY_PRTC1_TSST_MSK (0xfu)

/** \brief  Offset for Ifx_ERAY_PRTC1_Bits.TSST */
#define IFX_ERAY_PRTC1_TSST_OFF (0u)

/** \brief  Length for Ifx_ERAY_PRTC2_Bits.RXI */
#define IFX_ERAY_PRTC2_RXI_LEN (6u)

/** \brief  Mask for Ifx_ERAY_PRTC2_Bits.RXI */
#define IFX_ERAY_PRTC2_RXI_MSK (0x3fu)

/** \brief  Offset for Ifx_ERAY_PRTC2_Bits.RXI */
#define IFX_ERAY_PRTC2_RXI_OFF (0u)

/** \brief  Length for Ifx_ERAY_PRTC2_Bits.RXL */
#define IFX_ERAY_PRTC2_RXL_LEN (6u)

/** \brief  Mask for Ifx_ERAY_PRTC2_Bits.RXL */
#define IFX_ERAY_PRTC2_RXL_MSK (0x3fu)

/** \brief  Offset for Ifx_ERAY_PRTC2_Bits.RXL */
#define IFX_ERAY_PRTC2_RXL_OFF (8u)

/** \brief  Length for Ifx_ERAY_PRTC2_Bits.TXI */
#define IFX_ERAY_PRTC2_TXI_LEN (8u)

/** \brief  Mask for Ifx_ERAY_PRTC2_Bits.TXI */
#define IFX_ERAY_PRTC2_TXI_MSK (0xffu)

/** \brief  Offset for Ifx_ERAY_PRTC2_Bits.TXI */
#define IFX_ERAY_PRTC2_TXI_OFF (16u)

/** \brief  Length for Ifx_ERAY_PRTC2_Bits.TXL */
#define IFX_ERAY_PRTC2_TXL_LEN (6u)

/** \brief  Mask for Ifx_ERAY_PRTC2_Bits.TXL */
#define IFX_ERAY_PRTC2_TXL_MSK (0x3fu)

/** \brief  Offset for Ifx_ERAY_PRTC2_Bits.TXL */
#define IFX_ERAY_PRTC2_TXL_OFF (24u)

/** \brief  Length for Ifx_ERAY_RCV_Bits.RCV */
#define IFX_ERAY_RCV_RCV_LEN (12u)

/** \brief  Mask for Ifx_ERAY_RCV_Bits.RCV */
#define IFX_ERAY_RCV_RCV_MSK (0xfffu)

/** \brief  Offset for Ifx_ERAY_RCV_Bits.RCV */
#define IFX_ERAY_RCV_RCV_OFF (0u)

/** \brief  Length for Ifx_ERAY_RDDS_Bits.MDRB0 */
#define IFX_ERAY_RDDS_MDRB0_LEN (8u)

/** \brief  Mask for Ifx_ERAY_RDDS_Bits.MDRB0 */
#define IFX_ERAY_RDDS_MDRB0_MSK (0xffu)

/** \brief  Offset for Ifx_ERAY_RDDS_Bits.MDRB0 */
#define IFX_ERAY_RDDS_MDRB0_OFF (0u)

/** \brief  Length for Ifx_ERAY_RDDS_Bits.MDRB1 */
#define IFX_ERAY_RDDS_MDRB1_LEN (8u)

/** \brief  Mask for Ifx_ERAY_RDDS_Bits.MDRB1 */
#define IFX_ERAY_RDDS_MDRB1_MSK (0xffu)

/** \brief  Offset for Ifx_ERAY_RDDS_Bits.MDRB1 */
#define IFX_ERAY_RDDS_MDRB1_OFF (8u)

/** \brief  Length for Ifx_ERAY_RDDS_Bits.MDRB2 */
#define IFX_ERAY_RDDS_MDRB2_LEN (8u)

/** \brief  Mask for Ifx_ERAY_RDDS_Bits.MDRB2 */
#define IFX_ERAY_RDDS_MDRB2_MSK (0xffu)

/** \brief  Offset for Ifx_ERAY_RDDS_Bits.MDRB2 */
#define IFX_ERAY_RDDS_MDRB2_OFF (16u)

/** \brief  Length for Ifx_ERAY_RDDS_Bits.MDRB3 */
#define IFX_ERAY_RDDS_MDRB3_LEN (8u)

/** \brief  Mask for Ifx_ERAY_RDDS_Bits.MDRB3 */
#define IFX_ERAY_RDDS_MDRB3_MSK (0xffu)

/** \brief  Offset for Ifx_ERAY_RDDS_Bits.MDRB3 */
#define IFX_ERAY_RDDS_MDRB3_OFF (24u)

/** \brief  Length for Ifx_ERAY_RDHS1_Bits.CFG */
#define IFX_ERAY_RDHS1_CFG_LEN (1u)

/** \brief  Mask for Ifx_ERAY_RDHS1_Bits.CFG */
#define IFX_ERAY_RDHS1_CFG_MSK (0x1u)

/** \brief  Offset for Ifx_ERAY_RDHS1_Bits.CFG */
#define IFX_ERAY_RDHS1_CFG_OFF (26u)

/** \brief  Length for Ifx_ERAY_RDHS1_Bits.CHA */
#define IFX_ERAY_RDHS1_CHA_LEN (1u)

/** \brief  Mask for Ifx_ERAY_RDHS1_Bits.CHA */
#define IFX_ERAY_RDHS1_CHA_MSK (0x1u)

/** \brief  Offset for Ifx_ERAY_RDHS1_Bits.CHA */
#define IFX_ERAY_RDHS1_CHA_OFF (24u)

/** \brief  Length for Ifx_ERAY_RDHS1_Bits.CHB */
#define IFX_ERAY_RDHS1_CHB_LEN (1u)

/** \brief  Mask for Ifx_ERAY_RDHS1_Bits.CHB */
#define IFX_ERAY_RDHS1_CHB_MSK (0x1u)

/** \brief  Offset for Ifx_ERAY_RDHS1_Bits.CHB */
#define IFX_ERAY_RDHS1_CHB_OFF (25u)

/** \brief  Length for Ifx_ERAY_RDHS1_Bits.CYC */
#define IFX_ERAY_RDHS1_CYC_LEN (7u)

/** \brief  Mask for Ifx_ERAY_RDHS1_Bits.CYC */
#define IFX_ERAY_RDHS1_CYC_MSK (0x7fu)

/** \brief  Offset for Ifx_ERAY_RDHS1_Bits.CYC */
#define IFX_ERAY_RDHS1_CYC_OFF (16u)

/** \brief  Length for Ifx_ERAY_RDHS1_Bits.FID */
#define IFX_ERAY_RDHS1_FID_LEN (11u)

/** \brief  Mask for Ifx_ERAY_RDHS1_Bits.FID */
#define IFX_ERAY_RDHS1_FID_MSK (0x7ffu)

/** \brief  Offset for Ifx_ERAY_RDHS1_Bits.FID */
#define IFX_ERAY_RDHS1_FID_OFF (0u)

/** \brief  Length for Ifx_ERAY_RDHS1_Bits.MBI */
#define IFX_ERAY_RDHS1_MBI_LEN (1u)

/** \brief  Mask for Ifx_ERAY_RDHS1_Bits.MBI */
#define IFX_ERAY_RDHS1_MBI_MSK (0x1u)

/** \brief  Offset for Ifx_ERAY_RDHS1_Bits.MBI */
#define IFX_ERAY_RDHS1_MBI_OFF (29u)

/** \brief  Length for Ifx_ERAY_RDHS1_Bits.PPIT */
#define IFX_ERAY_RDHS1_PPIT_LEN (1u)

/** \brief  Mask for Ifx_ERAY_RDHS1_Bits.PPIT */
#define IFX_ERAY_RDHS1_PPIT_MSK (0x1u)

/** \brief  Offset for Ifx_ERAY_RDHS1_Bits.PPIT */
#define IFX_ERAY_RDHS1_PPIT_OFF (27u)

/** \brief  Length for Ifx_ERAY_RDHS1_Bits.TXM */
#define IFX_ERAY_RDHS1_TXM_LEN (1u)

/** \brief  Mask for Ifx_ERAY_RDHS1_Bits.TXM */
#define IFX_ERAY_RDHS1_TXM_MSK (0x1u)

/** \brief  Offset for Ifx_ERAY_RDHS1_Bits.TXM */
#define IFX_ERAY_RDHS1_TXM_OFF (28u)

/** \brief  Length for Ifx_ERAY_RDHS2_Bits.CRC */
#define IFX_ERAY_RDHS2_CRC_LEN (11u)

/** \brief  Mask for Ifx_ERAY_RDHS2_Bits.CRC */
#define IFX_ERAY_RDHS2_CRC_MSK (0x7ffu)

/** \brief  Offset for Ifx_ERAY_RDHS2_Bits.CRC */
#define IFX_ERAY_RDHS2_CRC_OFF (0u)

/** \brief  Length for Ifx_ERAY_RDHS2_Bits.PLC */
#define IFX_ERAY_RDHS2_PLC_LEN (7u)

/** \brief  Mask for Ifx_ERAY_RDHS2_Bits.PLC */
#define IFX_ERAY_RDHS2_PLC_MSK (0x7fu)

/** \brief  Offset for Ifx_ERAY_RDHS2_Bits.PLC */
#define IFX_ERAY_RDHS2_PLC_OFF (16u)

/** \brief  Length for Ifx_ERAY_RDHS2_Bits.PLR */
#define IFX_ERAY_RDHS2_PLR_LEN (7u)

/** \brief  Mask for Ifx_ERAY_RDHS2_Bits.PLR */
#define IFX_ERAY_RDHS2_PLR_MSK (0x7fu)

/** \brief  Offset for Ifx_ERAY_RDHS2_Bits.PLR */
#define IFX_ERAY_RDHS2_PLR_OFF (24u)

/** \brief  Length for Ifx_ERAY_RDHS3_Bits.DP */
#define IFX_ERAY_RDHS3_DP_LEN (11u)

/** \brief  Mask for Ifx_ERAY_RDHS3_Bits.DP */
#define IFX_ERAY_RDHS3_DP_MSK (0x7ffu)

/** \brief  Offset for Ifx_ERAY_RDHS3_Bits.DP */
#define IFX_ERAY_RDHS3_DP_OFF (0u)

/** \brief  Length for Ifx_ERAY_RDHS3_Bits.NFI */
#define IFX_ERAY_RDHS3_NFI_LEN (1u)

/** \brief  Mask for Ifx_ERAY_RDHS3_Bits.NFI */
#define IFX_ERAY_RDHS3_NFI_MSK (0x1u)

/** \brief  Offset for Ifx_ERAY_RDHS3_Bits.NFI */
#define IFX_ERAY_RDHS3_NFI_OFF (27u)

/** \brief  Length for Ifx_ERAY_RDHS3_Bits.PPI */
#define IFX_ERAY_RDHS3_PPI_LEN (1u)

