leonNg369/tc234_pxros_bsp_example/bsp/uc/uc_tc23/reg_tc23x_um_v1.1.R1/_Reg/IfxEray_bf.h
/** \brief  Mask for Ifx_ERAY_TEST1_Bits.TXENB */
#define IFX_ERAY_TEST1_TXENB_MSK (0x1u)

/** \brief  Offset for Ifx_ERAY_TEST1_Bits.TXENB */
#define IFX_ERAY_TEST1_TXENB_OFF (21u)

/** \brief  Length for Ifx_ERAY_TEST1_Bits.WRTEN */
#define IFX_ERAY_TEST1_WRTEN_LEN (1u)

/** \brief  Mask for Ifx_ERAY_TEST1_Bits.WRTEN */
#define IFX_ERAY_TEST1_WRTEN_MSK (0x1u)

/** \brief  Offset for Ifx_ERAY_TEST1_Bits.WRTEN */
#define IFX_ERAY_TEST1_WRTEN_OFF (0u)

/** \brief  Length for Ifx_ERAY_TEST2_Bits.RS */
#define IFX_ERAY_TEST2_RS_LEN (3u)

/** \brief  Mask for Ifx_ERAY_TEST2_Bits.RS */
#define IFX_ERAY_TEST2_RS_MSK (0x7u)

/** \brief  Offset for Ifx_ERAY_TEST2_Bits.RS */
#define IFX_ERAY_TEST2_RS_OFF (0u)

/** \brief  Length for Ifx_ERAY_TEST2_Bits.SSEL */
#define IFX_ERAY_TEST2_SSEL_LEN (3u)

/** \brief  Mask for Ifx_ERAY_TEST2_Bits.SSEL */
#define IFX_ERAY_TEST2_SSEL_MSK (0x7u)

/** \brief  Offset for Ifx_ERAY_TEST2_Bits.SSEL */
#define IFX_ERAY_TEST2_SSEL_OFF (4u)

/** \brief  Length for Ifx_ERAY_TEST2_Bits.WRECC */
#define IFX_ERAY_TEST2_WRECC_LEN (1u)

/** \brief  Mask for Ifx_ERAY_TEST2_Bits.WRECC */
#define IFX_ERAY_TEST2_WRECC_MSK (0x1u)

/** \brief  Offset for Ifx_ERAY_TEST2_Bits.WRECC */
#define IFX_ERAY_TEST2_WRECC_OFF (14u)

/** \brief  Length for Ifx_ERAY_TXRQ1_Bits.TXR0 */
#define IFX_ERAY_TXRQ1_TXR0_LEN (1u)

/** \brief  Mask for Ifx_ERAY_TXRQ1_Bits.TXR0 */
#define IFX_ERAY_TXRQ1_TXR0_MSK (0x1u)

/** \brief  Offset for Ifx_ERAY_TXRQ1_Bits.TXR0 */
#define IFX_ERAY_TXRQ1_TXR0_OFF (0u)

/** \brief  Length for Ifx_ERAY_TXRQ1_Bits.TXR10 */
#define IFX_ERAY_TXRQ1_TXR10_LEN (1u)

/** \brief  Mask for Ifx_ERAY_TXRQ1_Bits.TXR10 */
#define IFX_ERAY_TXRQ1_TXR10_MSK (0x1u)

/** \brief  Offset for Ifx_ERAY_TXRQ1_Bits.TXR10 */
#define IFX_ERAY_TXRQ1_TXR10_OFF (10u)

/** \brief  Length for Ifx_ERAY_TXRQ1_Bits.TXR11 */
#define IFX_ERAY_TXRQ1_TXR11_LEN (1u)

/** \brief  Mask for Ifx_ERAY_TXRQ1_Bits.TXR11 */
#define IFX_ERAY_TXRQ1_TXR11_MSK (0x1u)

/** \brief  Offset for Ifx_ERAY_TXRQ1_Bits.TXR11 */
#define IFX_ERAY_TXRQ1_TXR11_OFF (11u)

/** \brief  Length for Ifx_ERAY_TXRQ1_Bits.TXR12 */
#define IFX_ERAY_TXRQ1_TXR12_LEN (1u)

/** \brief  Mask for Ifx_ERAY_TXRQ1_Bits.TXR12 */
#define IFX_ERAY_TXRQ1_TXR12_MSK (0x1u)

/** \brief  Offset for Ifx_ERAY_TXRQ1_Bits.TXR12 */
#define IFX_ERAY_TXRQ1_TXR12_OFF (12u)

/** \brief  Length for Ifx_ERAY_TXRQ1_Bits.TXR13 */
#define IFX_ERAY_TXRQ1_TXR13_LEN (1u)

/** \brief  Mask for Ifx_ERAY_TXRQ1_Bits.TXR13 */
#define IFX_ERAY_TXRQ1_TXR13_MSK (0x1u)

/** \brief  Offset for Ifx_ERAY_TXRQ1_Bits.TXR13 */
#define IFX_ERAY_TXRQ1_TXR13_OFF (13u)

/** \brief  Length for Ifx_ERAY_TXRQ1_Bits.TXR14 */
#define IFX_ERAY_TXRQ1_TXR14_LEN (1u)

/** \brief  Mask for Ifx_ERAY_TXRQ1_Bits.TXR14 */
#define IFX_ERAY_TXRQ1_TXR14_MSK (0x1u)

/** \brief  Offset for Ifx_ERAY_TXRQ1_Bits.TXR14 */
#define IFX_ERAY_TXRQ1_TXR14_OFF (14u)

/** \brief  Length for Ifx_ERAY_TXRQ1_Bits.TXR15 */
#define IFX_ERAY_TXRQ1_TXR15_LEN (1u)

/** \brief  Mask for Ifx_ERAY_TXRQ1_Bits.TXR15 */
#define IFX_ERAY_TXRQ1_TXR15_MSK (0x1u)

/** \brief  Offset for Ifx_ERAY_TXRQ1_Bits.TXR15 */
#define IFX_ERAY_TXRQ1_TXR15_OFF (15u)

/** \brief  Length for Ifx_ERAY_TXRQ1_Bits.TXR16 */
#define IFX_ERAY_TXRQ1_TXR16_LEN (1u)

/** \brief  Mask for Ifx_ERAY_TXRQ1_Bits.TXR16 */
#define IFX_ERAY_TXRQ1_TXR16_MSK (0x1u)

/** \brief  Offset for Ifx_ERAY_TXRQ1_Bits.TXR16 */
#define IFX_ERAY_TXRQ1_TXR16_OFF (16u)

/** \brief  Length for Ifx_ERAY_TXRQ1_Bits.TXR17 */
#define IFX_ERAY_TXRQ1_TXR17_LEN (1u)

/** \brief  Mask for Ifx_ERAY_TXRQ1_Bits.TXR17 */
#define IFX_ERAY_TXRQ1_TXR17_MSK (0x1u)

/** \brief  Offset for Ifx_ERAY_TXRQ1_Bits.TXR17 */
#define IFX_ERAY_TXRQ1_TXR17_OFF (17u)

/** \brief  Length for Ifx_ERAY_TXRQ1_Bits.TXR18 */
#define IFX_ERAY_TXRQ1_TXR18_LEN (1u)

/** \brief  Mask for Ifx_ERAY_TXRQ1_Bits.TXR18 */
#define IFX_ERAY_TXRQ1_TXR18_MSK (0x1u)

/** \brief  Offset for Ifx_ERAY_TXRQ1_Bits.TXR18 */
#define IFX_ERAY_TXRQ1_TXR18_OFF (18u)

/** \brief  Length for Ifx_ERAY_TXRQ1_Bits.TXR19 */
#define IFX_ERAY_TXRQ1_TXR19_LEN (1u)

/** \brief  Mask for Ifx_ERAY_TXRQ1_Bits.TXR19 */
#define IFX_ERAY_TXRQ1_TXR19_MSK (0x1u)

/** \brief  Offset for Ifx_ERAY_TXRQ1_Bits.TXR19 */
#define IFX_ERAY_TXRQ1_TXR19_OFF (19u)

/** \brief  Length for Ifx_ERAY_TXRQ1_Bits.TXR1 */
#define IFX_ERAY_TXRQ1_TXR1_LEN (1u)

/** \brief  Mask for Ifx_ERAY_TXRQ1_Bits.TXR1 */
#define IFX_ERAY_TXRQ1_TXR1_MSK (0x1u)

/** \brief  Offset for Ifx_ERAY_TXRQ1_Bits.TXR1 */
#define IFX_ERAY_TXRQ1_TXR1_OFF (1u)

/** \brief  Length for Ifx_ERAY_TXRQ1_Bits.TXR20 */
#define IFX_ERAY_TXRQ1_TXR20_LEN (1u)

/** \brief  Mask for Ifx_ERAY_TXRQ1_Bits.TXR20 */
#define IFX_ERAY_TXRQ1_TXR20_MSK (0x1u)

/** \brief  Offset for Ifx_ERAY_TXRQ1_Bits.TXR20 */
#define IFX_ERAY_TXRQ1_TXR20_OFF (20u)

/** \brief  Length for Ifx_ERAY_TXRQ1_Bits.TXR21 */
#define IFX_ERAY_TXRQ1_TXR21_LEN (1u)

/** \brief  Mask for Ifx_ERAY_TXRQ1_Bits.TXR21 */
#define IFX_ERAY_TXRQ1_TXR21_MSK (0x1u)

/** \brief  Offset for Ifx_ERAY_TXRQ1_Bits.TXR21 */
#define IFX_ERAY_TXRQ1_TXR21_OFF (21u)

/** \brief  Length for Ifx_ERAY_TXRQ1_Bits.TXR22 */
#define IFX_ERAY_TXRQ1_TXR22_LEN (1u)

/** \brief  Mask for Ifx_ERAY_TXRQ1_Bits.TXR22 */
#define IFX_ERAY_TXRQ1_TXR22_MSK (0x1u)

/** \brief  Offset for Ifx_ERAY_TXRQ1_Bits.TXR22 */
#define IFX_ERAY_TXRQ1_TXR22_OFF (22u)

/** \brief  Length for Ifx_ERAY_TXRQ1_Bits.TXR23 */
#define IFX_ERAY_TXRQ1_TXR23_LEN (1u)

/** \brief  Mask for Ifx_ERAY_TXRQ1_Bits.TXR23 */
#define IFX_ERAY_TXRQ1_TXR23_MSK (0x1u)

/** \brief  Offset for Ifx_ERAY_TXRQ1_Bits.TXR23 */
#define IFX_ERAY_TXRQ1_TXR23_OFF (23u)

/** \brief  Length for Ifx_ERAY_TXRQ1_Bits.TXR24 */
#define IFX_ERAY_TXRQ1_TXR24_LEN (1u)

/** \brief  Mask for Ifx_ERAY_TXRQ1_Bits.TXR24 */
#define IFX_ERAY_TXRQ1_TXR24_MSK (0x1u)

/** \brief  Offset for Ifx_ERAY_TXRQ1_Bits.TXR24 */
#define IFX_ERAY_TXRQ1_TXR24_OFF (24u)

/** \brief  Length for Ifx_ERAY_TXRQ1_Bits.TXR25 */
#define IFX_ERAY_TXRQ1_TXR25_LEN (1u)

/** \brief  Mask for Ifx_ERAY_TXRQ1_Bits.TXR25 */
#define IFX_ERAY_TXRQ1_TXR25_MSK (0x1u)

/** \brief  Offset for Ifx_ERAY_TXRQ1_Bits.TXR25 */
#define IFX_ERAY_TXRQ1_TXR25_OFF (25u)

/** \brief  Length for Ifx_ERAY_TXRQ1_Bits.TXR26 */
#define IFX_ERAY_TXRQ1_TXR26_LEN (1u)

