leonNg369/tc234_pxros_bsp_example/bsp/uc/uc_tc23/reg_tc23x_um_v1.1.R1/_Reg/IfxEray_bf.h
/** \brief  Offset for Ifx_ERAY_TXRQ2_Bits.TXR40 */
#define IFX_ERAY_TXRQ2_TXR40_OFF (8u)

/** \brief  Length for Ifx_ERAY_TXRQ2_Bits.TXR41 */
#define IFX_ERAY_TXRQ2_TXR41_LEN (1u)

/** \brief  Mask for Ifx_ERAY_TXRQ2_Bits.TXR41 */
#define IFX_ERAY_TXRQ2_TXR41_MSK (0x1u)

/** \brief  Offset for Ifx_ERAY_TXRQ2_Bits.TXR41 */
#define IFX_ERAY_TXRQ2_TXR41_OFF (9u)

/** \brief  Length for Ifx_ERAY_TXRQ2_Bits.TXR42 */
#define IFX_ERAY_TXRQ2_TXR42_LEN (1u)

/** \brief  Mask for Ifx_ERAY_TXRQ2_Bits.TXR42 */
#define IFX_ERAY_TXRQ2_TXR42_MSK (0x1u)

/** \brief  Offset for Ifx_ERAY_TXRQ2_Bits.TXR42 */
#define IFX_ERAY_TXRQ2_TXR42_OFF (10u)

/** \brief  Length for Ifx_ERAY_TXRQ2_Bits.TXR43 */
#define IFX_ERAY_TXRQ2_TXR43_LEN (1u)

/** \brief  Mask for Ifx_ERAY_TXRQ2_Bits.TXR43 */
#define IFX_ERAY_TXRQ2_TXR43_MSK (0x1u)

/** \brief  Offset for Ifx_ERAY_TXRQ2_Bits.TXR43 */
#define IFX_ERAY_TXRQ2_TXR43_OFF (11u)

/** \brief  Length for Ifx_ERAY_TXRQ2_Bits.TXR44 */
#define IFX_ERAY_TXRQ2_TXR44_LEN (1u)

/** \brief  Mask for Ifx_ERAY_TXRQ2_Bits.TXR44 */
#define IFX_ERAY_TXRQ2_TXR44_MSK (0x1u)

/** \brief  Offset for Ifx_ERAY_TXRQ2_Bits.TXR44 */
#define IFX_ERAY_TXRQ2_TXR44_OFF (12u)

/** \brief  Length for Ifx_ERAY_TXRQ2_Bits.TXR45 */
#define IFX_ERAY_TXRQ2_TXR45_LEN (1u)

/** \brief  Mask for Ifx_ERAY_TXRQ2_Bits.TXR45 */
#define IFX_ERAY_TXRQ2_TXR45_MSK (0x1u)

/** \brief  Offset for Ifx_ERAY_TXRQ2_Bits.TXR45 */
#define IFX_ERAY_TXRQ2_TXR45_OFF (13u)

/** \brief  Length for Ifx_ERAY_TXRQ2_Bits.TXR46 */
#define IFX_ERAY_TXRQ2_TXR46_LEN (1u)

/** \brief  Mask for Ifx_ERAY_TXRQ2_Bits.TXR46 */
#define IFX_ERAY_TXRQ2_TXR46_MSK (0x1u)

/** \brief  Offset for Ifx_ERAY_TXRQ2_Bits.TXR46 */
#define IFX_ERAY_TXRQ2_TXR46_OFF (14u)

/** \brief  Length for Ifx_ERAY_TXRQ2_Bits.TXR47 */
#define IFX_ERAY_TXRQ2_TXR47_LEN (1u)

/** \brief  Mask for Ifx_ERAY_TXRQ2_Bits.TXR47 */
#define IFX_ERAY_TXRQ2_TXR47_MSK (0x1u)

/** \brief  Offset for Ifx_ERAY_TXRQ2_Bits.TXR47 */
#define IFX_ERAY_TXRQ2_TXR47_OFF (15u)

/** \brief  Length for Ifx_ERAY_TXRQ2_Bits.TXR48 */
#define IFX_ERAY_TXRQ2_TXR48_LEN (1u)

/** \brief  Mask for Ifx_ERAY_TXRQ2_Bits.TXR48 */
#define IFX_ERAY_TXRQ2_TXR48_MSK (0x1u)

/** \brief  Offset for Ifx_ERAY_TXRQ2_Bits.TXR48 */
#define IFX_ERAY_TXRQ2_TXR48_OFF (16u)

/** \brief  Length for Ifx_ERAY_TXRQ2_Bits.TXR49 */
#define IFX_ERAY_TXRQ2_TXR49_LEN (1u)

/** \brief  Mask for Ifx_ERAY_TXRQ2_Bits.TXR49 */
#define IFX_ERAY_TXRQ2_TXR49_MSK (0x1u)

/** \brief  Offset for Ifx_ERAY_TXRQ2_Bits.TXR49 */
#define IFX_ERAY_TXRQ2_TXR49_OFF (17u)

/** \brief  Length for Ifx_ERAY_TXRQ2_Bits.TXR50 */
#define IFX_ERAY_TXRQ2_TXR50_LEN (1u)

/** \brief  Mask for Ifx_ERAY_TXRQ2_Bits.TXR50 */
#define IFX_ERAY_TXRQ2_TXR50_MSK (0x1u)

/** \brief  Offset for Ifx_ERAY_TXRQ2_Bits.TXR50 */
#define IFX_ERAY_TXRQ2_TXR50_OFF (18u)

/** \brief  Length for Ifx_ERAY_TXRQ2_Bits.TXR51 */
#define IFX_ERAY_TXRQ2_TXR51_LEN (1u)

/** \brief  Mask for Ifx_ERAY_TXRQ2_Bits.TXR51 */
#define IFX_ERAY_TXRQ2_TXR51_MSK (0x1u)

/** \brief  Offset for Ifx_ERAY_TXRQ2_Bits.TXR51 */
#define IFX_ERAY_TXRQ2_TXR51_OFF (19u)

/** \brief  Length for Ifx_ERAY_TXRQ2_Bits.TXR52 */
#define IFX_ERAY_TXRQ2_TXR52_LEN (1u)

/** \brief  Mask for Ifx_ERAY_TXRQ2_Bits.TXR52 */
#define IFX_ERAY_TXRQ2_TXR52_MSK (0x1u)

/** \brief  Offset for Ifx_ERAY_TXRQ2_Bits.TXR52 */
#define IFX_ERAY_TXRQ2_TXR52_OFF (20u)

/** \brief  Length for Ifx_ERAY_TXRQ2_Bits.TXR53 */
#define IFX_ERAY_TXRQ2_TXR53_LEN (1u)

/** \brief  Mask for Ifx_ERAY_TXRQ2_Bits.TXR53 */
#define IFX_ERAY_TXRQ2_TXR53_MSK (0x1u)

/** \brief  Offset for Ifx_ERAY_TXRQ2_Bits.TXR53 */
#define IFX_ERAY_TXRQ2_TXR53_OFF (21u)

/** \brief  Length for Ifx_ERAY_TXRQ2_Bits.TXR54 */
#define IFX_ERAY_TXRQ2_TXR54_LEN (1u)

/** \brief  Mask for Ifx_ERAY_TXRQ2_Bits.TXR54 */
#define IFX_ERAY_TXRQ2_TXR54_MSK (0x1u)

/** \brief  Offset for Ifx_ERAY_TXRQ2_Bits.TXR54 */
#define IFX_ERAY_TXRQ2_TXR54_OFF (22u)

/** \brief  Length for Ifx_ERAY_TXRQ2_Bits.TXR55 */
#define IFX_ERAY_TXRQ2_TXR55_LEN (1u)

/** \brief  Mask for Ifx_ERAY_TXRQ2_Bits.TXR55 */
#define IFX_ERAY_TXRQ2_TXR55_MSK (0x1u)

/** \brief  Offset for Ifx_ERAY_TXRQ2_Bits.TXR55 */
#define IFX_ERAY_TXRQ2_TXR55_OFF (23u)

/** \brief  Length for Ifx_ERAY_TXRQ2_Bits.TXR56 */
#define IFX_ERAY_TXRQ2_TXR56_LEN (1u)

/** \brief  Mask for Ifx_ERAY_TXRQ2_Bits.TXR56 */
#define IFX_ERAY_TXRQ2_TXR56_MSK (0x1u)

/** \brief  Offset for Ifx_ERAY_TXRQ2_Bits.TXR56 */
#define IFX_ERAY_TXRQ2_TXR56_OFF (24u)

/** \brief  Length for Ifx_ERAY_TXRQ2_Bits.TXR57 */
#define IFX_ERAY_TXRQ2_TXR57_LEN (1u)

/** \brief  Mask for Ifx_ERAY_TXRQ2_Bits.TXR57 */
#define IFX_ERAY_TXRQ2_TXR57_MSK (0x1u)

/** \brief  Offset for Ifx_ERAY_TXRQ2_Bits.TXR57 */
#define IFX_ERAY_TXRQ2_TXR57_OFF (25u)

/** \brief  Length for Ifx_ERAY_TXRQ2_Bits.TXR58 */
#define IFX_ERAY_TXRQ2_TXR58_LEN (1u)

/** \brief  Mask for Ifx_ERAY_TXRQ2_Bits.TXR58 */
#define IFX_ERAY_TXRQ2_TXR58_MSK (0x1u)

/** \brief  Offset for Ifx_ERAY_TXRQ2_Bits.TXR58 */
#define IFX_ERAY_TXRQ2_TXR58_OFF (26u)

/** \brief  Length for Ifx_ERAY_TXRQ2_Bits.TXR59 */
#define IFX_ERAY_TXRQ2_TXR59_LEN (1u)

/** \brief  Mask for Ifx_ERAY_TXRQ2_Bits.TXR59 */
#define IFX_ERAY_TXRQ2_TXR59_MSK (0x1u)

/** \brief  Offset for Ifx_ERAY_TXRQ2_Bits.TXR59 */
#define IFX_ERAY_TXRQ2_TXR59_OFF (27u)

/** \brief  Length for Ifx_ERAY_TXRQ2_Bits.TXR60 */
#define IFX_ERAY_TXRQ2_TXR60_LEN (1u)

/** \brief  Mask for Ifx_ERAY_TXRQ2_Bits.TXR60 */
#define IFX_ERAY_TXRQ2_TXR60_MSK (0x1u)

/** \brief  Offset for Ifx_ERAY_TXRQ2_Bits.TXR60 */
#define IFX_ERAY_TXRQ2_TXR60_OFF (28u)

/** \brief  Length for Ifx_ERAY_TXRQ2_Bits.TXR61 */
#define IFX_ERAY_TXRQ2_TXR61_LEN (1u)

/** \brief  Mask for Ifx_ERAY_TXRQ2_Bits.TXR61 */
#define IFX_ERAY_TXRQ2_TXR61_MSK (0x1u)

/** \brief  Offset for Ifx_ERAY_TXRQ2_Bits.TXR61 */
#define IFX_ERAY_TXRQ2_TXR61_OFF (29u)

/** \brief  Length for Ifx_ERAY_TXRQ2_Bits.TXR62 */
#define IFX_ERAY_TXRQ2_TXR62_LEN (1u)

/** \brief  Mask for Ifx_ERAY_TXRQ2_Bits.TXR62 */
#define IFX_ERAY_TXRQ2_TXR62_MSK (0x1u)

/** \brief  Offset for Ifx_ERAY_TXRQ2_Bits.TXR62 */
#define IFX_ERAY_TXRQ2_TXR62_OFF (30u)

/** \brief  Length for Ifx_ERAY_TXRQ2_Bits.TXR63 */
#define IFX_ERAY_TXRQ2_TXR63_LEN (1u)

/** \brief  Mask for Ifx_ERAY_TXRQ2_Bits.TXR63 */
#define IFX_ERAY_TXRQ2_TXR63_MSK (0x1u)

/** \brief  Offset for Ifx_ERAY_TXRQ2_Bits.TXR63 */
#define IFX_ERAY_TXRQ2_TXR63_OFF (31u)

/** \brief  Length for Ifx_ERAY_TXRQ3_Bits.TXR64 */
#define IFX_ERAY_TXRQ3_TXR64_LEN (1u)

/** \brief  Mask for Ifx_ERAY_TXRQ3_Bits.TXR64 */
#define IFX_ERAY_TXRQ3_TXR64_MSK (0x1u)

/** \brief  Offset for Ifx_ERAY_TXRQ3_Bits.TXR64 */
#define IFX_ERAY_TXRQ3_TXR64_OFF (0u)

/** \brief  Length for Ifx_ERAY_TXRQ3_Bits.TXR65 */
#define IFX_ERAY_TXRQ3_TXR65_LEN (1u)

/** \brief  Mask for Ifx_ERAY_TXRQ3_Bits.TXR65 */
#define IFX_ERAY_TXRQ3_TXR65_MSK (0x1u)

/** \brief  Offset for Ifx_ERAY_TXRQ3_Bits.TXR65 */
#define IFX_ERAY_TXRQ3_TXR65_OFF (1u)

