leonNg369/tc234_pxros_bsp_example/bsp/uc/uc_tc23/reg_tc23x_um_v1.1.R1/_Reg/IfxEray_bf.h
/** \brief  Length for Ifx_ERAY_TXRQ3_Bits.TXR66 */
#define IFX_ERAY_TXRQ3_TXR66_LEN (1u)

/** \brief  Mask for Ifx_ERAY_TXRQ3_Bits.TXR66 */
#define IFX_ERAY_TXRQ3_TXR66_MSK (0x1u)

/** \brief  Offset for Ifx_ERAY_TXRQ3_Bits.TXR66 */
#define IFX_ERAY_TXRQ3_TXR66_OFF (2u)

/** \brief  Length for Ifx_ERAY_TXRQ3_Bits.TXR67 */
#define IFX_ERAY_TXRQ3_TXR67_LEN (1u)

/** \brief  Mask for Ifx_ERAY_TXRQ3_Bits.TXR67 */
#define IFX_ERAY_TXRQ3_TXR67_MSK (0x1u)

/** \brief  Offset for Ifx_ERAY_TXRQ3_Bits.TXR67 */
#define IFX_ERAY_TXRQ3_TXR67_OFF (3u)

/** \brief  Length for Ifx_ERAY_TXRQ3_Bits.TXR68 */
#define IFX_ERAY_TXRQ3_TXR68_LEN (1u)

/** \brief  Mask for Ifx_ERAY_TXRQ3_Bits.TXR68 */
#define IFX_ERAY_TXRQ3_TXR68_MSK (0x1u)

/** \brief  Offset for Ifx_ERAY_TXRQ3_Bits.TXR68 */
#define IFX_ERAY_TXRQ3_TXR68_OFF (4u)

/** \brief  Length for Ifx_ERAY_TXRQ3_Bits.TXR69 */
#define IFX_ERAY_TXRQ3_TXR69_LEN (1u)

/** \brief  Mask for Ifx_ERAY_TXRQ3_Bits.TXR69 */
#define IFX_ERAY_TXRQ3_TXR69_MSK (0x1u)

/** \brief  Offset for Ifx_ERAY_TXRQ3_Bits.TXR69 */
#define IFX_ERAY_TXRQ3_TXR69_OFF (5u)

/** \brief  Length for Ifx_ERAY_TXRQ3_Bits.TXR70 */
#define IFX_ERAY_TXRQ3_TXR70_LEN (1u)

/** \brief  Mask for Ifx_ERAY_TXRQ3_Bits.TXR70 */
#define IFX_ERAY_TXRQ3_TXR70_MSK (0x1u)

/** \brief  Offset for Ifx_ERAY_TXRQ3_Bits.TXR70 */
#define IFX_ERAY_TXRQ3_TXR70_OFF (6u)

/** \brief  Length for Ifx_ERAY_TXRQ3_Bits.TXR71 */
#define IFX_ERAY_TXRQ3_TXR71_LEN (1u)

/** \brief  Mask for Ifx_ERAY_TXRQ3_Bits.TXR71 */
#define IFX_ERAY_TXRQ3_TXR71_MSK (0x1u)

/** \brief  Offset for Ifx_ERAY_TXRQ3_Bits.TXR71 */
#define IFX_ERAY_TXRQ3_TXR71_OFF (7u)

/** \brief  Length for Ifx_ERAY_TXRQ3_Bits.TXR72 */
#define IFX_ERAY_TXRQ3_TXR72_LEN (1u)

/** \brief  Mask for Ifx_ERAY_TXRQ3_Bits.TXR72 */
#define IFX_ERAY_TXRQ3_TXR72_MSK (0x1u)

/** \brief  Offset for Ifx_ERAY_TXRQ3_Bits.TXR72 */
#define IFX_ERAY_TXRQ3_TXR72_OFF (8u)

/** \brief  Length for Ifx_ERAY_TXRQ3_Bits.TXR73 */
#define IFX_ERAY_TXRQ3_TXR73_LEN (1u)

/** \brief  Mask for Ifx_ERAY_TXRQ3_Bits.TXR73 */
#define IFX_ERAY_TXRQ3_TXR73_MSK (0x1u)

/** \brief  Offset for Ifx_ERAY_TXRQ3_Bits.TXR73 */
#define IFX_ERAY_TXRQ3_TXR73_OFF (9u)

/** \brief  Length for Ifx_ERAY_TXRQ3_Bits.TXR74 */
#define IFX_ERAY_TXRQ3_TXR74_LEN (1u)

/** \brief  Mask for Ifx_ERAY_TXRQ3_Bits.TXR74 */
#define IFX_ERAY_TXRQ3_TXR74_MSK (0x1u)

/** \brief  Offset for Ifx_ERAY_TXRQ3_Bits.TXR74 */
#define IFX_ERAY_TXRQ3_TXR74_OFF (10u)

/** \brief  Length for Ifx_ERAY_TXRQ3_Bits.TXR75 */
#define IFX_ERAY_TXRQ3_TXR75_LEN (1u)

/** \brief  Mask for Ifx_ERAY_TXRQ3_Bits.TXR75 */
#define IFX_ERAY_TXRQ3_TXR75_MSK (0x1u)

/** \brief  Offset for Ifx_ERAY_TXRQ3_Bits.TXR75 */
#define IFX_ERAY_TXRQ3_TXR75_OFF (11u)

/** \brief  Length for Ifx_ERAY_TXRQ3_Bits.TXR76 */
#define IFX_ERAY_TXRQ3_TXR76_LEN (1u)

/** \brief  Mask for Ifx_ERAY_TXRQ3_Bits.TXR76 */
#define IFX_ERAY_TXRQ3_TXR76_MSK (0x1u)

/** \brief  Offset for Ifx_ERAY_TXRQ3_Bits.TXR76 */
#define IFX_ERAY_TXRQ3_TXR76_OFF (12u)

/** \brief  Length for Ifx_ERAY_TXRQ3_Bits.TXR77 */
#define IFX_ERAY_TXRQ3_TXR77_LEN (1u)

/** \brief  Mask for Ifx_ERAY_TXRQ3_Bits.TXR77 */
#define IFX_ERAY_TXRQ3_TXR77_MSK (0x1u)

/** \brief  Offset for Ifx_ERAY_TXRQ3_Bits.TXR77 */
#define IFX_ERAY_TXRQ3_TXR77_OFF (13u)

/** \brief  Length for Ifx_ERAY_TXRQ3_Bits.TXR78 */
#define IFX_ERAY_TXRQ3_TXR78_LEN (1u)

/** \brief  Mask for Ifx_ERAY_TXRQ3_Bits.TXR78 */
#define IFX_ERAY_TXRQ3_TXR78_MSK (0x1u)

/** \brief  Offset for Ifx_ERAY_TXRQ3_Bits.TXR78 */
#define IFX_ERAY_TXRQ3_TXR78_OFF (14u)

/** \brief  Length for Ifx_ERAY_TXRQ3_Bits.TXR79 */
#define IFX_ERAY_TXRQ3_TXR79_LEN (1u)

/** \brief  Mask for Ifx_ERAY_TXRQ3_Bits.TXR79 */
#define IFX_ERAY_TXRQ3_TXR79_MSK (0x1u)

/** \brief  Offset for Ifx_ERAY_TXRQ3_Bits.TXR79 */
#define IFX_ERAY_TXRQ3_TXR79_OFF (15u)

/** \brief  Length for Ifx_ERAY_TXRQ3_Bits.TXR80 */
#define IFX_ERAY_TXRQ3_TXR80_LEN (1u)

/** \brief  Mask for Ifx_ERAY_TXRQ3_Bits.TXR80 */
#define IFX_ERAY_TXRQ3_TXR80_MSK (0x1u)

/** \brief  Offset for Ifx_ERAY_TXRQ3_Bits.TXR80 */
#define IFX_ERAY_TXRQ3_TXR80_OFF (16u)

/** \brief  Length for Ifx_ERAY_TXRQ3_Bits.TXR81 */
#define IFX_ERAY_TXRQ3_TXR81_LEN (1u)

/** \brief  Mask for Ifx_ERAY_TXRQ3_Bits.TXR81 */
#define IFX_ERAY_TXRQ3_TXR81_MSK (0x1u)

/** \brief  Offset for Ifx_ERAY_TXRQ3_Bits.TXR81 */
#define IFX_ERAY_TXRQ3_TXR81_OFF (17u)

/** \brief  Length for Ifx_ERAY_TXRQ3_Bits.TXR82 */
#define IFX_ERAY_TXRQ3_TXR82_LEN (1u)

/** \brief  Mask for Ifx_ERAY_TXRQ3_Bits.TXR82 */
#define IFX_ERAY_TXRQ3_TXR82_MSK (0x1u)

/** \brief  Offset for Ifx_ERAY_TXRQ3_Bits.TXR82 */
#define IFX_ERAY_TXRQ3_TXR82_OFF (18u)

/** \brief  Length for Ifx_ERAY_TXRQ3_Bits.TXR83 */
#define IFX_ERAY_TXRQ3_TXR83_LEN (1u)

/** \brief  Mask for Ifx_ERAY_TXRQ3_Bits.TXR83 */
#define IFX_ERAY_TXRQ3_TXR83_MSK (0x1u)

/** \brief  Offset for Ifx_ERAY_TXRQ3_Bits.TXR83 */
#define IFX_ERAY_TXRQ3_TXR83_OFF (19u)

/** \brief  Length for Ifx_ERAY_TXRQ3_Bits.TXR84 */
#define IFX_ERAY_TXRQ3_TXR84_LEN (1u)

/** \brief  Mask for Ifx_ERAY_TXRQ3_Bits.TXR84 */
#define IFX_ERAY_TXRQ3_TXR84_MSK (0x1u)

/** \brief  Offset for Ifx_ERAY_TXRQ3_Bits.TXR84 */
#define IFX_ERAY_TXRQ3_TXR84_OFF (20u)

/** \brief  Length for Ifx_ERAY_TXRQ3_Bits.TXR85 */
#define IFX_ERAY_TXRQ3_TXR85_LEN (1u)

/** \brief  Mask for Ifx_ERAY_TXRQ3_Bits.TXR85 */
#define IFX_ERAY_TXRQ3_TXR85_MSK (0x1u)

/** \brief  Offset for Ifx_ERAY_TXRQ3_Bits.TXR85 */
#define IFX_ERAY_TXRQ3_TXR85_OFF (21u)

/** \brief  Length for Ifx_ERAY_TXRQ3_Bits.TXR86 */
#define IFX_ERAY_TXRQ3_TXR86_LEN (1u)

/** \brief  Mask for Ifx_ERAY_TXRQ3_Bits.TXR86 */
#define IFX_ERAY_TXRQ3_TXR86_MSK (0x1u)

/** \brief  Offset for Ifx_ERAY_TXRQ3_Bits.TXR86 */
#define IFX_ERAY_TXRQ3_TXR86_OFF (22u)

/** \brief  Length for Ifx_ERAY_TXRQ3_Bits.TXR87 */
#define IFX_ERAY_TXRQ3_TXR87_LEN (1u)

/** \brief  Mask for Ifx_ERAY_TXRQ3_Bits.TXR87 */
#define IFX_ERAY_TXRQ3_TXR87_MSK (0x1u)

/** \brief  Offset for Ifx_ERAY_TXRQ3_Bits.TXR87 */
#define IFX_ERAY_TXRQ3_TXR87_OFF (23u)

/** \brief  Length for Ifx_ERAY_TXRQ3_Bits.TXR88 */
#define IFX_ERAY_TXRQ3_TXR88_LEN (1u)

/** \brief  Mask for Ifx_ERAY_TXRQ3_Bits.TXR88 */
#define IFX_ERAY_TXRQ3_TXR88_MSK (0x1u)

/** \brief  Offset for Ifx_ERAY_TXRQ3_Bits.TXR88 */
#define IFX_ERAY_TXRQ3_TXR88_OFF (24u)

/** \brief  Length for Ifx_ERAY_TXRQ3_Bits.TXR89 */
#define IFX_ERAY_TXRQ3_TXR89_LEN (1u)

/** \brief  Mask for Ifx_ERAY_TXRQ3_Bits.TXR89 */
#define IFX_ERAY_TXRQ3_TXR89_MSK (0x1u)

/** \brief  Offset for Ifx_ERAY_TXRQ3_Bits.TXR89 */
#define IFX_ERAY_TXRQ3_TXR89_OFF (25u)

/** \brief  Length for Ifx_ERAY_TXRQ3_Bits.TXR90 */
#define IFX_ERAY_TXRQ3_TXR90_LEN (1u)

