leonNg369/tc234_pxros_bsp_example/bsp/uc/uc_tc23/reg_tc23x_um_v1.1.R1/_Reg/IfxEray_bf.h
/** \brief  Length for Ifx_ERAY_WRHS1_Bits.MBI */
#define IFX_ERAY_WRHS1_MBI_LEN (1u)

/** \brief  Mask for Ifx_ERAY_WRHS1_Bits.MBI */
#define IFX_ERAY_WRHS1_MBI_MSK (0x1u)

/** \brief  Offset for Ifx_ERAY_WRHS1_Bits.MBI */
#define IFX_ERAY_WRHS1_MBI_OFF (29u)

/** \brief  Length for Ifx_ERAY_WRHS1_Bits.PPIT */
#define IFX_ERAY_WRHS1_PPIT_LEN (1u)

/** \brief  Mask for Ifx_ERAY_WRHS1_Bits.PPIT */
#define IFX_ERAY_WRHS1_PPIT_MSK (0x1u)

/** \brief  Offset for Ifx_ERAY_WRHS1_Bits.PPIT */
#define IFX_ERAY_WRHS1_PPIT_OFF (27u)

/** \brief  Length for Ifx_ERAY_WRHS1_Bits.TXM */
#define IFX_ERAY_WRHS1_TXM_LEN (1u)

/** \brief  Mask for Ifx_ERAY_WRHS1_Bits.TXM */
#define IFX_ERAY_WRHS1_TXM_MSK (0x1u)

/** \brief  Offset for Ifx_ERAY_WRHS1_Bits.TXM */
#define IFX_ERAY_WRHS1_TXM_OFF (28u)

/** \brief  Length for Ifx_ERAY_WRHS2_Bits.CRC */
#define IFX_ERAY_WRHS2_CRC_LEN (11u)

/** \brief  Mask for Ifx_ERAY_WRHS2_Bits.CRC */
#define IFX_ERAY_WRHS2_CRC_MSK (0x7ffu)

/** \brief  Offset for Ifx_ERAY_WRHS2_Bits.CRC */
#define IFX_ERAY_WRHS2_CRC_OFF (0u)

/** \brief  Length for Ifx_ERAY_WRHS2_Bits.PLC */
#define IFX_ERAY_WRHS2_PLC_LEN (7u)

/** \brief  Mask for Ifx_ERAY_WRHS2_Bits.PLC */
#define IFX_ERAY_WRHS2_PLC_MSK (0x7fu)

/** \brief  Offset for Ifx_ERAY_WRHS2_Bits.PLC */
#define IFX_ERAY_WRHS2_PLC_OFF (16u)

/** \brief  Length for Ifx_ERAY_WRHS3_Bits.DP */
#define IFX_ERAY_WRHS3_DP_LEN (11u)

/** \brief  Mask for Ifx_ERAY_WRHS3_Bits.DP */
#define IFX_ERAY_WRHS3_DP_MSK (0x7ffu)

/** \brief  Offset for Ifx_ERAY_WRHS3_Bits.DP */
#define IFX_ERAY_WRHS3_DP_OFF (0u)
/** \}  */
/******************************************************************************/
/******************************************************************************/
#endif /* IFXERAY_BF_H */
